[
    {
        "0": [
            "Economics (ECON) 435 - Principles of Big Data Management Systems has class ID Economics (ECON) 435. Economics (ECON) 435 - Principles of Big Data Management Systems has class title Economics (ECON) 435. Economics (ECON) 435 - Principles of Big Data Management Systems is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Friday at 5pm-7:20pm.",
            "Economics (ECON) 435 - Principles of Big Data Management Systems  has class ID Economics (ECON) 435. Economics (ECON) 435 - Principles of Big Data Management Systems  has class title Economics (ECON) 435. Economics (ECON) 435 - Principles of Big Data Management Systems  is offered in 1 quarters. In 2024 spring quarter, ec 80 is offered on Monday Wednesday at 12:30pm-1:45pm.",
            "Computer Science (COM SCI) 181 - Introduction to Formal Languages and Automata Theory has class ID Computer Science (COM SCI) 181. Computer Science (COM SCI) 181 - Introduction to Formal Languages and Automata Theory has class title Computer Science (COM SCI) 181. Computer Science (COM SCI) 181 - Introduction to Formal Languages and Automata Theory is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Tuesday Thursday at 4pm-5:50pm.",
            "Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  is offered in 1 quarters. In 2022 winter quarter, ec 16 is offered on Wednesday at 1pm-3:50pm.",
            "Economics (ECON) 213B - General Equilibrium and Game Theory has class ID Economics (ECON) 213B. Economics (ECON) 213B - General Equilibrium and Game Theory has class title Economics (ECON) 213B. Economics (ECON) 213B - General Equilibrium and Game Theory is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Monday Wednesday at 11am-12:15pm."
        ]
    },
    {
        "1": [
            "Chemistry and Biochemistry (CHEM) 136 - Organic Structural Methods has class ID Chemistry and Biochemistry (CHEM) 136. Chemistry and Biochemistry (CHEM) 136 - Organic Structural Methods has class title Chemistry and Biochemistry (CHEM) 136. Chemistry and Biochemistry (CHEM) 136 - Organic Structural Methods is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Thursday at 12pm-1:50pm.",
            "Chemistry and Biochemistry (CHEM) C222 - Mathematical Methods for Chemistry has class ID Chemistry and Biochemistry (CHEM) C222. Chemistry and Biochemistry (CHEM) C222 - Mathematical Methods for Chemistry has class title Chemistry and Biochemistry (CHEM) C222. Chemistry and Biochemistry (CHEM) C222 - Mathematical Methods for Chemistry is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday Friday at 10am-10:50am.",
            "Chemistry and Biochemistry (CHEM) C122 - Mathematical Methods for Chemistry has class ID Chemistry and Biochemistry (CHEM) C122. Chemistry and Biochemistry (CHEM) C122 - Mathematical Methods for Chemistry has class title Chemistry and Biochemistry (CHEM) C122. Chemistry and Biochemistry (CHEM) C122 - Mathematical Methods for Chemistry is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday Friday at 10am-10:50am.",
            "Chemistry and Biochemistry (CHEM) C126A - Computational Methods for Chemists has class ID Chemistry and Biochemistry (CHEM) C126A. Chemistry and Biochemistry (CHEM) C126A - Computational Methods for Chemists has class title Chemistry and Biochemistry (CHEM) C126A. Chemistry and Biochemistry (CHEM) C126A - Computational Methods for Chemists is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:50pm.",
            "Chemistry and Biochemistry (CHEM) 14AE - General Chemistry for Life Scientists I--Enhanced has class ID Chemistry and Biochemistry (CHEM) 14AE. Chemistry and Biochemistry (CHEM) 14AE - General Chemistry for Life Scientists I--Enhanced has class title Chemistry and Biochemistry (CHEM) 14AE. Chemistry and Biochemistry (CHEM) 14AE - General Chemistry for Life Scientists I--Enhanced is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday Friday at 2pm-2:50pm."
        ]
    },
    {
        "2": [
            "Linguistics (LING) 204C - Speech Perception has class ID Linguistics (LING) 204C. Linguistics (LING) 204C - Speech Perception has class title Linguistics (LING) 204C. Linguistics (LING) 204C - Speech Perception is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Tuesday Thursday at 10am-11:50am.",
            "Linguistics (LING) 204B - Speech Production has class ID Linguistics (LING) 204B. Linguistics (LING) 204B - Speech Production has class title Linguistics (LING) 204B. Linguistics (LING) 204B - Speech Production is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Tuesday Thursday at 10am-11:50am.",
            "Art 132 - Survey of Critical Thought: Critical Human has class ID Art 132. Art 132 - Survey of Critical Thought: Critical Human has class title Art 132. Art 132 - Survey of Critical Thought: Critical Human is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Wednesday at 6:30pm-9:20pm.",
            "Art 132 - Survey of Critical Thought has class ID Art 132. Art 132 - Survey of Critical Thought has class title Art 132. Art 132 - Survey of Critical Thought is offered in 2 quarters. In 2021 spring quarter, Lec 1 is offered on Friday at 12pm-2:50pm. In 2022 winter quarter, Lec 1 is offered on Tuesday at 6:30pm-9:20pm.",
            "American Indian Studies (AM IND) 238A - Tribal Legal Development Clinic has class ID American Indian Studies (AM IND) 238A. American Indian Studies (AM IND) 238A - Tribal Legal Development Clinic has class title American Indian Studies (AM IND) 238A. American Indian Studies (AM IND) 238A - Tribal Legal Development Clinic is offered in 2 quarters. In 2020 winter quarter, Lec 1 is offered on Wednesday at 10am-11:50am. In 2022 winter quarter, Lec 1 is offered on Wednesday at 10am-12pm."
        ]
    },
    {
        "3": [
            "History (HIST) 179A - Variable Topics in History of Medicine: Foundations of Modern Medicine has class ID History (HIST) 179A. History (HIST) 179A - Variable Topics in History of Medicine: Foundations of Modern Medicine has class title History (HIST) 179A. History (HIST) 179A - Variable Topics in History of Medicine: Foundations of Modern Medicine is offered in 1 quarters. In 2022 fall quarter, Lec 2 is offered on Monday Wednesday at 12:30pm-1:45pm.",
            "History (HIST) 179A - Variable Topics in History of Medicine: Medicine and Empire has class ID History (HIST) 179A. History (HIST) 179A - Variable Topics in History of Medicine: Medicine and Empire has class title History (HIST) 179A. History (HIST) 179A - Variable Topics in History of Medicine: Medicine and Empire is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Tuesday Thursday at 5pm-6:15pm.",
            "History (HIST) 179A - Variable Topics in History of Medicine: History of Global Health Technologies has class ID History (HIST) 179A. History (HIST) 179A - Variable Topics in History of Medicine: History of Global Health Technologies has class title History (HIST) 179A. History (HIST) 179A - Variable Topics in History of Medicine: History of Global Health Technologies is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Tuesday Thursday at 9:30am-10:45am.",
            "History (HIST) 179A - Variable Topics in History of Medicine: Epidemics and Society has class ID History (HIST) 179A. History (HIST) 179A - Variable Topics in History of Medicine: Epidemics and Society has class title History (HIST) 179A. History (HIST) 179A - Variable Topics in History of Medicine: Epidemics and Society is offered in 1 quarters. In 2022 spring quarter, Lec 2 is offered on Tuesday Thursday at 12:30pm-1:45pm.",
            "History (HIST) 179B - History of Medicine: Foundations of Modern Medicine: The Making of Modern Medicine: Body, Medical Encounters, and Imperialism has class ID History (HIST) 179B. History (HIST) 179B - History of Medicine: Foundations of Modern Medicine: The Making of Modern Medicine: Body, Medical Encounters, and Imperialism has class title History (HIST) 179B. History (HIST) 179B - History of Medicine: Foundations of Modern Medicine: The Making of Modern Medicine: Body, Medical Encounters, and Imperialism is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Monday Wednesday Friday at 2pm-2:50pm."
        ]
    },
    {
        "4": [
            "Management (MGMT) 298D - Special Topics in Management: Corporate Governance has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance is offered in 1 quarters. In 2023 spring quarter, Lec 7 is offered on Wednesday at 7:10pm-10pm.",
            "Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  is offered in 1 quarters. In 2022 winter quarter, ec 16 is offered on Wednesday at 1pm-3:50pm.",
            "Management (MGMT) 298D - Special Topics in Management: Corporate Governance  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance  is offered in 1 quarters. In 2022 winter quarter, ec 15 is offered on Wednesday at 7:10pm-10pm.",
            "Management (MGMT) 298D - Special Topics in Management: Foundations of Strategy Research  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Foundations of Strategy Research  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Foundations of Strategy Research  is offered in 1 quarters. In 2022 winter quarter, ec 23 is offered on Wednesday at 1pm-4pm.",
            "Management (MGMT) 298D - Special Topics in Management has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management is offered in 1 quarters. In 2022 fall quarter, Lec 5 is offered on Wednesday at 4:10pm-7pm."
        ]
    },
    {
        "5": [
            "Electrical and Computer Engineering (EC ENGR) 236C - Optimization Methods for Large-Scale Systems has class ID Electrical and Computer Engineering (EC ENGR) 236C. Electrical and Computer Engineering (EC ENGR) 236C - Optimization Methods for Large-Scale Systems has class title Electrical and Computer Engineering (EC ENGR) 236C. Electrical and Computer Engineering (EC ENGR) 236C - Optimization Methods for Large-Scale Systems is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:50pm.",
            "Electrical and Computer Engineering (EC ENGR) 163A - Introductory Microwave Circuits has class ID Electrical and Computer Engineering (EC ENGR) 163A. Electrical and Computer Engineering (EC ENGR) 163A - Introductory Microwave Circuits has class title Electrical and Computer Engineering (EC ENGR) 163A. Electrical and Computer Engineering (EC ENGR) 163A - Introductory Microwave Circuits is offered in 1 quarters. In 2021 fall quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:50pm.",
            "Electrical and Computer Engineering (EC ENGR) 279AS - Special Topics in Physical and Wave Electronics has class ID Electrical and Computer Engineering (EC ENGR) 279AS. Electrical and Computer Engineering (EC ENGR) 279AS - Special Topics in Physical and Wave Electronics has class title Electrical and Computer Engineering (EC ENGR) 279AS. Electrical and Computer Engineering (EC ENGR) 279AS - Special Topics in Physical and Wave Electronics is offered in 1 quarters. In 2024 spring quarter, Lec 2 is offered on Tuesday Thursday at 10am-11:50am.",
            "Electrical and Computer Engineering (EC ENGR) 239AS - Special Topics in Signals and Systems has class ID Electrical and Computer Engineering (EC ENGR) 239AS. Electrical and Computer Engineering (EC ENGR) 239AS - Special Topics in Signals and Systems has class title Electrical and Computer Engineering (EC ENGR) 239AS. Electrical and Computer Engineering (EC ENGR) 239AS - Special Topics in Signals and Systems is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Monday Wednesday at 10am-11:50am.",
            "Electrical and Computer Engineering (EC ENGR) 149 - Foundations of Computer Vision has class ID Electrical and Computer Engineering (EC ENGR) 149. Electrical and Computer Engineering (EC ENGR) 149 - Foundations of Computer Vision has class title Electrical and Computer Engineering (EC ENGR) 149. Electrical and Computer Engineering (EC ENGR) 149 - Foundations of Computer Vision is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Tuesday Thursday at 12pm-1:50pm."
        ]
    },
    {
        "6": [
            "Communication (COMM) 188B - Variable Topics in Interpersonal Communication: Mating in the Modern World has class ID Communication (COMM) 188B. Communication (COMM) 188B - Variable Topics in Interpersonal Communication: Mating in the Modern World has class title Communication (COMM) 188B. Communication (COMM) 188B - Variable Topics in Interpersonal Communication: Mating in the Modern World is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Tuesday Thursday at 12:30pm-1:45pm.",
            "Social Welfare (SOC WLF) M142XP - Intergenerational Communication across Lifespan has class ID Social Welfare (SOC WLF) M142XP. Social Welfare (SOC WLF) M142XP - Intergenerational Communication across Lifespan has class title Social Welfare (SOC WLF) M142XP. Social Welfare (SOC WLF) M142XP - Intergenerational Communication across Lifespan is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday at 10am-11:50am.",
            "Communication (COMM) 126 - Evolution of Interpersonal Communication has class ID Communication (COMM) 126. Communication (COMM) 126 - Evolution of Interpersonal Communication has class title Communication (COMM) 126. Communication (COMM) 126 - Evolution of Interpersonal Communication is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Tuesday Thursday at 12:30pm-1:45pm.",
            "Communication (COMM) 123 - Social Cognition has class ID Communication (COMM) 123. Communication (COMM) 123 - Social Cognition has class title Communication (COMM) 123. Communication (COMM) 123 - Social Cognition is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "Communication (COMM) M123 - Language and Society: Introduction to Sociolinguistics has class ID Communication (COMM) M123. Communication (COMM) M123 - Language and Society: Introduction to Sociolinguistics has class title Communication (COMM) M123. Communication (COMM) M123 - Language and Society: Introduction to Sociolinguistics is offered in 1 quarters. In 2021 spring quarter, Lec 1 is offered on Tuesday Thursday at 10am-11:50am."
        ]
    },
    {
        "7": [
            "Anthropology (ANTHRO) 159 - Selected Topics in Linguistic Anthropology: Human-Nonhuman Communication: Anthropological Perspectives on Language and Cross-Species Interaction has class ID Anthropology (ANTHRO) 159. Anthropology (ANTHRO) 159 - Selected Topics in Linguistic Anthropology: Human-Nonhuman Communication: Anthropological Perspectives on Language and Cross-Species Interaction has class title Anthropology (ANTHRO) 159. Anthropology (ANTHRO) 159 - Selected Topics in Linguistic Anthropology: Human-Nonhuman Communication: Anthropological Perspectives on Language and Cross-Species Interaction is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Tuesday Thursday at 5pm-6:15pm.",
            "English (ENGL) 106 - Studies in Native American and Indigenous Literatures: Indigenous Literature of North America has class ID English (ENGL) 106. English (ENGL) 106 - Studies in Native American and Indigenous Literatures: Indigenous Literature of North America has class title English (ENGL) 106. English (ENGL) 106 - Studies in Native American and Indigenous Literatures: Indigenous Literature of North America is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Tuesday Thursday at TR.",
            "Linguistics (LING) 208 - Mathematical Structures in Language I has class ID Linguistics (LING) 208. Linguistics (LING) 208 - Mathematical Structures in Language I has class title Linguistics (LING) 208. Linguistics (LING) 208 - Mathematical Structures in Language I is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Tuesday Thursday at 12pm-1:50pm.",
            "English (ENGL) 106 - Studies in Native American and Indigenous Literatures: Indigenous Literatures of North America has class ID English (ENGL) 106. English (ENGL) 106 - Studies in Native American and Indigenous Literatures: Indigenous Literatures of North America has class title English (ENGL) 106. English (ENGL) 106 - Studies in Native American and Indigenous Literatures: Indigenous Literatures of North America is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday Wednesday at 4pm-5:50pm.",
            "English (ENGL) 133 - Transatlantic Literatures and Cultures: Technology and Racial Difference in Age of Colonialism has class ID English (ENGL) 133. English (ENGL) 133 - Transatlantic Literatures and Cultures: Technology and Racial Difference in Age of Colonialism has class title English (ENGL) 133. English (ENGL) 133 - Transatlantic Literatures and Cultures: Technology and Racial Difference in Age of Colonialism is offered in 1 quarters. In 2022 fall quarter, Lec 2 is offered on Tuesday Thursday at 10am-11:50am."
        ]
    },
    {
        "8": [
            "Theater C454D - Script Analysis for Sound Design has class ID Theater C454D. Theater C454D - Script Analysis for Sound Design has class title Theater C454D. Theater C454D - Script Analysis for Sound Design is offered in 1 quarters. In 2023 spring quarter, Lec 1 is offered on Tuesday at 9am-12:50pm.",
            "Theater C453E - History of Costume Design in Movies has class ID Theater C453E. Theater C453E - History of Costume Design in Movies has class title Theater C453E. Theater C453E - History of Costume Design in Movies is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Tuesday at 9am-12:50pm.",
            "Theater C452C - Lighting Design for Television has class ID Theater C452C. Theater C452C - Lighting Design for Television has class title Theater C452C. Theater C452C - Lighting Design for Television is offered in 1 quarters. In 2023 spring quarter, Lec 1 is offered on Friday at 9am-12:50pm.",
            "Theater 441B - Lighting Design has class ID Theater 441B. Theater 441B - Lighting Design has class title Theater 441B. Theater 441B - Lighting Design is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday at 9am-12:50pm.",
            "Theater C153E - History of Costume Design in Movies has class ID Theater C153E. Theater C153E - History of Costume Design in Movies has class title Theater C153E. Theater C153E - History of Costume Design in Movies is offered in 2 quarters. In 2021 spring quarter, Lec 1 is offered on Tuesday at T. In 2024 spring quarter, Lec 1 is offered on Tuesday at 9am-12:50pm."
        ]
    },
    {
        "9": [
            "Economics (ECON) 111 - Theories of Development has class ID Economics (ECON) 111. Economics (ECON) 111 - Theories of Development has class title Economics (ECON) 111. Economics (ECON) 111 - Theories of Development is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "Economics (ECON) 207 - History of Economic Thought has class ID Economics (ECON) 207. Economics (ECON) 207 - History of Economic Thought has class title Economics (ECON) 207. Economics (ECON) 207 - History of Economic Thought is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:15pm.",
            "History (HIST) 170B - Selected Topics in Chinese History from 1500: Race and Ethnicity in China, 1500 to Present has class ID History (HIST) 170B. History (HIST) 170B - Selected Topics in Chinese History from 1500: Race and Ethnicity in China, 1500 to Present has class title History (HIST) 170B. History (HIST) 170B - Selected Topics in Chinese History from 1500: Race and Ethnicity in China, 1500 to Present is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday Wednesday Friday at 12pm-12:50pm.",
            "Economics (ECON) 287C - Topics in Development Economics: Economic Development has class ID Economics (ECON) 287C. Economics (ECON) 287C - Topics in Development Economics: Economic Development has class title Economics (ECON) 287C. Economics (ECON) 287C - Topics in Development Economics: Economic Development is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Wednesday at 10:30am-12:50pm.",
            "History (HIST) 9C - Introduction to Asian Civilizations: History of Japan has class ID History (HIST) 9C. History (HIST) 9C - Introduction to Asian Civilizations: History of Japan has class title History (HIST) 9C. History (HIST) 9C - Introduction to Asian Civilizations: History of Japan is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm."
        ]
    },
    {
        "10": [
            "Environment (ENVIRON) C259 - Life-Cycle Assessment has class ID Environment (ENVIRON) C259. Environment (ENVIRON) C259 - Life-Cycle Assessment has class title Environment (ENVIRON) C259. Environment (ENVIRON) C259 - Life-Cycle Assessment is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:15pm.",
            "Environment (ENVIRON) 175 - Programming with Big Environmental Datasets has class ID Environment (ENVIRON) 175. Environment (ENVIRON) 175 - Programming with Big Environmental Datasets has class title Environment (ENVIRON) 175. Environment (ENVIRON) 175 - Programming with Big Environmental Datasets is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Tuesday at 5pm-7:50pm.",
            "Environment (ENVIRON) M127 - Soils and Environment has class ID Environment (ENVIRON) M127. Environment (ENVIRON) M127 - Soils and Environment has class title Environment (ENVIRON) M127. Environment (ENVIRON) M127 - Soils and Environment is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Tuesday Thursday at 11am-12:15pm.",
            "Environment (ENVIRON) M30 - Environmental Literature and Culture has class ID Environment (ENVIRON) M30. Environment (ENVIRON) M30 - Environmental Literature and Culture has class title Environment (ENVIRON) M30. Environment (ENVIRON) M30 - Environmental Literature and Culture is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday at 12:30pm-1:45pm.",
            "Environment (ENVIRON) M133 - Environmental Sociology has class ID Environment (ENVIRON) M133. Environment (ENVIRON) M133 - Environmental Sociology has class title Environment (ENVIRON) M133. Environment (ENVIRON) M133 - Environmental Sociology is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Wednesday at 2pm-2:50pm."
        ]
    },
    {
        "11": [
            "English (ENGL) 128 - Postcolonial and Transnational Theory: Writing Resistance, from Empire to Decolonization has class ID English (ENGL) 128. English (ENGL) 128 - Postcolonial and Transnational Theory: Writing Resistance, from Empire to Decolonization has class title English (ENGL) 128. English (ENGL) 128 - Postcolonial and Transnational Theory: Writing Resistance, from Empire to Decolonization is offered in 1 quarters. In 2021 fall quarter, Lec 1 is offered on Monday Wednesday at 10am-11:50am.",
            "English (ENGL) 131 - Studies in Postcolonial Literatures: Diving Deep: Postcolonial Perspectives on Oceanic Imaginary has class ID English (ENGL) 131. English (ENGL) 131 - Studies in Postcolonial Literatures: Diving Deep: Postcolonial Perspectives on Oceanic Imaginary has class title English (ENGL) 131. English (ENGL) 131 - Studies in Postcolonial Literatures: Diving Deep: Postcolonial Perspectives on Oceanic Imaginary is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:50pm.",
            "Art 132 - Survey of Critical Thought: Critical Theories and Artistic Frameworks, 19th Century to Present has class ID Art 132. Art 132 - Survey of Critical Thought: Critical Theories and Artistic Frameworks, 19th Century to Present has class title Art 132. Art 132 - Survey of Critical Thought: Critical Theories and Artistic Frameworks, 19th Century to Present is offered in 1 quarters. In 2023 winter quarter, Lec 1 is offered on Wednesday at 6:30pm-9:20pm.",
            "English (ENGL) 177 - Interdisciplinary Studies of American Culture: Critical Approaches to Race and Visuality in American Culture has class ID English (ENGL) 177. English (ENGL) 177 - Interdisciplinary Studies of American Culture: Critical Approaches to Race and Visuality in American Culture has class title English (ENGL) 177. English (ENGL) 177 - Interdisciplinary Studies of American Culture: Critical Approaches to Race and Visuality in American Culture is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Monday Wednesday at 6pm-7:50pm.",
            "English (ENGL) 133 - Transatlantic Literatures and Cultures: Lives of Property in Colonial Atlantic World has class ID English (ENGL) 133. English (ENGL) 133 - Transatlantic Literatures and Cultures: Lives of Property in Colonial Atlantic World has class title English (ENGL) 133. English (ENGL) 133 - Transatlantic Literatures and Cultures: Lives of Property in Colonial Atlantic World is offered in 1 quarters. In 2023 fall quarter, Lec 2 is offered on Tuesday Thursday at 4pm-5:50pm."
        ]
    },
    {
        "12": [
            "Environmental Health Sciences (ENV HLT) 120 - Environment and Health has class ID Environmental Health Sciences (ENV HLT) 120. Environmental Health Sciences (ENV HLT) 120 - Environment and Health has class title Environmental Health Sciences (ENV HLT) 120. Environmental Health Sciences (ENV HLT) 120 - Environment and Health is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:50pm.",
            "Environmental Health Sciences (ENV HLT) 207 - Introduction to Geographic Information Systems has class ID Environmental Health Sciences (ENV HLT) 207. Environmental Health Sciences (ENV HLT) 207 - Introduction to Geographic Information Systems has class title Environmental Health Sciences (ENV HLT) 207. Environmental Health Sciences (ENV HLT) 207 - Introduction to Geographic Information Systems is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Wednesday at R.",
            "Public Health (PUB HLT) 188 - Special Courses in Public Health has class ID Public Health (PUB HLT) 188. Public Health (PUB HLT) 188 - Special Courses in Public Health has class title Public Health (PUB HLT) 188. Public Health (PUB HLT) 188 - Special Courses in Public Health is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Tuesday Thursday at 6pm-7:50pm.",
            "Environmental Health Sciences (ENV HLT) 170 - Climate Change and Public Health has class ID Environmental Health Sciences (ENV HLT) 170. Environmental Health Sciences (ENV HLT) 170 - Climate Change and Public Health has class title Environmental Health Sciences (ENV HLT) 170. Environmental Health Sciences (ENV HLT) 170 - Climate Change and Public Health is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Monday Wednesday at 9:30am-10:45am.",
            "Environmental Health Sciences (ENV HLT) 220 - Overview of Environmental Public Health Microbiology has class ID Environmental Health Sciences (ENV HLT) 220. Environmental Health Sciences (ENV HLT) 220 - Overview of Environmental Public Health Microbiology has class title Environmental Health Sciences (ENV HLT) 220. Environmental Health Sciences (ENV HLT) 220 - Overview of Environmental Public Health Microbiology is offered in 1 quarters. In 2023 winter quarter, Lec 1 is offered on Monday at 10am-11:50am."
        ]
    },
    {
        "13": [
            "Linguistics (LING) 8 - Language in Context has class ID Linguistics (LING) 8. Linguistics (LING) 8 - Language in Context has class title Linguistics (LING) 8. Linguistics (LING) 8 - Language in Context is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Tuesday Thursday at 10am-11:50am.",
            "Communication (COMM) 111 - Conflict and Communication has class ID Communication (COMM) 111. Communication (COMM) 111 - Conflict and Communication has class title Communication (COMM) 111. Communication (COMM) 111 - Conflict and Communication is offered in 2 quarters. In 2020 winter quarter, Lec 1 is offered on Friday at 12pm-2:50pm. In 2023 fall quarter, Lec 1 is offered on Tuesday Thursday at 12:30pm-1:45pm.",
            "Linguistics (LING) 165C - Semantics II has class ID Linguistics (LING) 165C. Linguistics (LING) 165C - Semantics II has class title Linguistics (LING) 165C. Linguistics (LING) 165C - Semantics II is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday Wednesday at 4pm-5:50pm.",
            "Education (EDUC) 202 - Evaluation Theory has class ID Education (EDUC) 202. Education (EDUC) 202 - Evaluation Theory has class title Education (EDUC) 202. Education (EDUC) 202 - Evaluation Theory is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Wednesday at 4pm-6:50pm.",
            "Communication (COMM) 126 - Evolution of Interpersonal Communication has class ID Communication (COMM) 126. Communication (COMM) 126 - Evolution of Interpersonal Communication has class title Communication (COMM) 126. Communication (COMM) 126 - Evolution of Interpersonal Communication is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Tuesday Thursday at 12:30pm-1:45pm."
        ]
    },
    {
        "14": [
            "Linguistics (LING) 208 - Mathematical Structures in Language I has class ID Linguistics (LING) 208. Linguistics (LING) 208 - Mathematical Structures in Language I has class title Linguistics (LING) 208. Linguistics (LING) 208 - Mathematical Structures in Language I is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Tuesday Thursday at 12pm-1:50pm.",
            "Linguistics (LING) 165C - Semantics II has class ID Linguistics (LING) 165C. Linguistics (LING) 165C - Semantics II has class title Linguistics (LING) 165C. Linguistics (LING) 165C - Semantics II is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday Wednesday at 4pm-5:50pm.",
            "Linguistics (LING) 185B - Computational Linguistics II has class ID Linguistics (LING) 185B. Linguistics (LING) 185B - Computational Linguistics II has class title Linguistics (LING) 185B. Linguistics (LING) 185B - Computational Linguistics II is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday Wednesday at 4pm-5:50pm.",
            "Linguistics (LING) 207 - Pragmatic Theory has class ID Linguistics (LING) 207. Linguistics (LING) 207 - Pragmatic Theory has class title Linguistics (LING) 207. Linguistics (LING) 207 - Pragmatic Theory is offered in 1 quarters. In 2023 winter quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:50pm.",
            "Linguistics (LING) 8 - Language in Context has class ID Linguistics (LING) 8. Linguistics (LING) 8 - Language in Context has class title Linguistics (LING) 8. Linguistics (LING) 8 - Language in Context is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Tuesday Thursday at 10am-11:50am."
        ]
    },
    {
        "15": [
            "Asian American Studies (ASIA AM) 120 - Representation and Resistance: Asian American Independent Cinema has class ID Asian American Studies (ASIA AM) 120. Asian American Studies (ASIA AM) 120 - Representation and Resistance: Asian American Independent Cinema has class title Asian American Studies (ASIA AM) 120. Asian American Studies (ASIA AM) 120 - Representation and Resistance: Asian American Independent Cinema is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Monday Wednesday at 3:30pm-4:45pm.",
            "Asian American Studies (ASIA AM) 120 - Yellow Peril's Revenge: Asian American Independent Cinema has class ID Asian American Studies (ASIA AM) 120. Asian American Studies (ASIA AM) 120 - Yellow Peril's Revenge: Asian American Independent Cinema has class title Asian American Studies (ASIA AM) 120. Asian American Studies (ASIA AM) 120 - Yellow Peril's Revenge: Asian American Independent Cinema is offered in 3 quarters. In 2020 fall quarter, Lec 1 is offered on Monday Wednesday at 11am-12:15pm. In 2022 winter quarter, Lec 1 is offered on Monday Wednesday at 3:30pm-4:45pm. In 2023 winter quarter, Lec 1 is offered on Monday Wednesday at 3:30pm-4:45pm.",
            "Asian American Studies (ASIA AM) M128 - Participatory Action Research on Youth Organizing for Racial Justice has class ID Asian American Studies (ASIA AM) M128. Asian American Studies (ASIA AM) M128 - Participatory Action Research on Youth Organizing for Racial Justice has class title Asian American Studies (ASIA AM) M128. Asian American Studies (ASIA AM) M128 - Participatory Action Research on Youth Organizing for Racial Justice is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday Wednesday at 4pm-5:50pm.",
            "Asian American Studies (ASIA AM) 187C - Special Courses in Asian American Populations and Communities has class ID Asian American Studies (ASIA AM) 187C. Asian American Studies (ASIA AM) 187C - Special Courses in Asian American Populations and Communities has class title Asian American Studies (ASIA AM) 187C. Asian American Studies (ASIA AM) 187C - Special Courses in Asian American Populations and Communities is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Friday at 2pm-4:50pm.",
            "Asian American Studies (ASIA AM) 187B - Special Courses in Asian American Themes: Asian American Foodways has class ID Asian American Studies (ASIA AM) 187B. Asian American Studies (ASIA AM) 187B - Special Courses in Asian American Themes: Asian American Foodways has class title Asian American Studies (ASIA AM) 187B. Asian American Studies (ASIA AM) 187B - Special Courses in Asian American Themes: Asian American Foodways is offered in 1 quarters. In 2023 spring quarter, Lec 1 is offered on Tuesday Thursday at 11am-12:15pm."
        ]
    },
    {
        "16": [
            "Anthropology (ANTHRO) 136A - Introduction to Psychological Anthropology: Historical Development has class ID Anthropology (ANTHRO) 136A. Anthropology (ANTHRO) 136A - Introduction to Psychological Anthropology: Historical Development has class title Anthropology (ANTHRO) 136A. Anthropology (ANTHRO) 136A - Introduction to Psychological Anthropology: Historical Development is offered in 1 quarters. In 2021 spring quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:15pm.",
            "Anthropology (ANTHRO) 149 - Selected Topics in Social Anthropology: Political Imprisonment has class ID Anthropology (ANTHRO) 149. Anthropology (ANTHRO) 149 - Selected Topics in Social Anthropology: Political Imprisonment has class title Anthropology (ANTHRO) 149. Anthropology (ANTHRO) 149 - Selected Topics in Social Anthropology: Political Imprisonment is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday at 3:30pm-4:45pm.",
            "Anthropology (ANTHRO) 149 - Selected Topics in Social Anthropology: Anthropology of Violence has class ID Anthropology (ANTHRO) 149. Anthropology (ANTHRO) 149 - Selected Topics in Social Anthropology: Anthropology of Violence has class title Anthropology (ANTHRO) 149. Anthropology (ANTHRO) 149 - Selected Topics in Social Anthropology: Anthropology of Violence is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Tuesday Thursday at 12:30pm-1:45pm.",
            "Anthropology (ANTHRO) 159 - Selected Topics in Linguistic Anthropology: Language and Climate Change has class ID Anthropology (ANTHRO) 159. Anthropology (ANTHRO) 159 - Selected Topics in Linguistic Anthropology: Language and Climate Change has class title Anthropology (ANTHRO) 159. Anthropology (ANTHRO) 159 - Selected Topics in Linguistic Anthropology: Language and Climate Change is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Tuesday Thursday at 12:30pm-1:45pm.",
            "Anthropology (ANTHRO) 129 - Selected Topics in Biological Anthropology: Human Neuroscience: Conceptual Approach for Social Science has class ID Anthropology (ANTHRO) 129. Anthropology (ANTHRO) 129 - Selected Topics in Biological Anthropology: Human Neuroscience: Conceptual Approach for Social Science has class title Anthropology (ANTHRO) 129. Anthropology (ANTHRO) 129 - Selected Topics in Biological Anthropology: Human Neuroscience: Conceptual Approach for Social Science is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:15pm."
        ]
    },
    {
        "17": [
            "Management (MGMT) 298D - Special Topics in Management has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management is offered in 1 quarters. In 2022 fall quarter, Lec 5 is offered on Wednesday at 4:10pm-7pm.",
            "Management (MGMT) 298D - Special Topics in Management: Judgement and Decision Making has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Judgement and Decision Making has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Judgement and Decision Making is offered in 1 quarters. In 2020 fall quarter, Lec 2 is offered on Monday at 1pm-4pm.",
            "Management (MGMT) 298D - Special Topics in Management: Corporate Governance has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance is offered in 1 quarters. In 2023 spring quarter, Lec 7 is offered on Wednesday at 7:10pm-10pm.",
            "Management (MGMT) 298E - Special Topics in Management: Performance Management has class ID Management (MGMT) 298E. Management (MGMT) 298E - Special Topics in Management: Performance Management has class title Management (MGMT) 298E. Management (MGMT) 298E - Special Topics in Management: Performance Management is offered in 1 quarters. In 2022 fall quarter, Lec 3 is offered on Wednesday at 1pm-3:50pm.",
            "Management (MGMT) 298D - Special Topics in Management: Corporate Governance  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance  is offered in 1 quarters. In 2022 winter quarter, ec 15 is offered on Wednesday at 7:10pm-10pm."
        ]
    },
    {
        "18": [
            "Engineering (ENGR) 188EW - Experimental Courses in Engineering Writing has class ID Engineering (ENGR) 188EW. Engineering (ENGR) 188EW - Experimental Courses in Engineering Writing has class title Engineering (ENGR) 188EW. Engineering (ENGR) 188EW - Experimental Courses in Engineering Writing is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Tuesday Thursday at 8am-9:50am.",
            "Engineering (ENGR) 188EW - Experimental Courses in Engineering Writing: Foundations of Ethical Responsibility has class ID Engineering (ENGR) 188EW. Engineering (ENGR) 188EW - Experimental Courses in Engineering Writing: Foundations of Ethical Responsibility has class title Engineering (ENGR) 188EW. Engineering (ENGR) 188EW - Experimental Courses in Engineering Writing: Foundations of Ethical Responsibility is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Tuesday Thursday at 8am-9:50am.",
            "Engineering (ENGR) 182EW - Technology and Law has class ID Engineering (ENGR) 182EW. Engineering (ENGR) 182EW - Technology and Law has class title Engineering (ENGR) 182EW. Engineering (ENGR) 182EW - Technology and Law is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday at 10am-11:50am.",
            "Engineering (ENGR) 96A - Introduction to Engineering Design  has class ID Engineering (ENGR) 96A. Engineering (ENGR) 96A - Introduction to Engineering Design  has class title Engineering (ENGR) 96A. Engineering (ENGR) 96A - Introduction to Engineering Design  is offered in 1 quarters. In 2023 fall quarter, ec 14 is offered on Monday at 12pm-1:50pm.",
            "Engineering (ENGR) 96A - Introduction to Engineering Design: Environmental Impact of University Student Diet  has class ID Engineering (ENGR) 96A. Engineering (ENGR) 96A - Introduction to Engineering Design: Environmental Impact of University Student Diet  has class title Engineering (ENGR) 96A. Engineering (ENGR) 96A - Introduction to Engineering Design: Environmental Impact of University Student Diet  is offered in 1 quarters. In 2024 winter quarter, ec 14 is offered on Monday at 2pm-3:50pm."
        ]
    },
    {
        "19": [
            "Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  is offered in 1 quarters. In 2022 winter quarter, ec 16 is offered on Wednesday at 1pm-3:50pm.",
            "Management (MGMT) 298D - Special Topics in Management: Critical Milestones in Preparing for Life of Leadership  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Critical Milestones in Preparing for Life of Leadership  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Critical Milestones in Preparing for Life of Leadership  is offered in 1 quarters. In 2023 spring quarter, ec 13 is offered on Monday at 4:10pm-7pm.",
            "Management (MGMT) 298D - Special Topics in Management: Judgement and Decision Making has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Judgement and Decision Making has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Judgement and Decision Making is offered in 1 quarters. In 2020 fall quarter, Lec 2 is offered on Monday at 1pm-4pm.",
            "Management (MGMT) 298D - Special Topics in Management: Corporate Governance has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance is offered in 1 quarters. In 2023 spring quarter, Lec 7 is offered on Wednesday at 7:10pm-10pm.",
            "Management (MGMT) 298D - Special Topics in Management: Corporate Governance  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance  is offered in 1 quarters. In 2022 winter quarter, ec 15 is offered on Wednesday at 7:10pm-10pm."
        ]
    },
    {
        "20": [
            "Art History (ART HIS) C151 - Selected Topics in Japanese Art: Introduction to Japanese Archaeology has class ID Art History (ART HIS) C151. Art History (ART HIS) C151 - Selected Topics in Japanese Art: Introduction to Japanese Archaeology has class title Art History (ART HIS) C151. Art History (ART HIS) C151 - Selected Topics in Japanese Art: Introduction to Japanese Archaeology is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "Art History (ART HIS) 251B - Japanese Art: Time and Narrative has class ID Art History (ART HIS) 251B. Art History (ART HIS) 251B - Japanese Art: Time and Narrative has class title Art History (ART HIS) 251B. Art History (ART HIS) 251B - Japanese Art: Time and Narrative is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Thursday at 11am-1:50pm.",
            "Art History (ART HIS) C151 - Selected Topics in Japanese Art: Gender and Japanese Art has class ID Art History (ART HIS) C151. Art History (ART HIS) C151 - Selected Topics in Japanese Art: Gender and Japanese Art has class title Art History (ART HIS) C151. Art History (ART HIS) C151 - Selected Topics in Japanese Art: Gender and Japanese Art is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Tuesday Thursday at 3:30pm-4:45pm.",
            "Art History (ART HIS) C149 - Selected Topics in Chinese Art has class ID Art History (ART HIS) C149. Art History (ART HIS) C149 - Selected Topics in Chinese Art has class title Art History (ART HIS) C149. Art History (ART HIS) C149 - Selected Topics in Chinese Art is offered in 1 quarters. In 2023 winter quarter, Lec 1 is offered on Monday at 10am-12:50pm.",
            "Art History (ART HIS) C251A - Selected Topics in Japanese Art: Graphic Arts of Japan has class ID Art History (ART HIS) C251A. Art History (ART HIS) C251A - Selected Topics in Japanese Art: Graphic Arts of Japan has class title Art History (ART HIS) C251A. Art History (ART HIS) C251A - Selected Topics in Japanese Art: Graphic Arts of Japan is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Monday Wednesday at 5pm-6:15pm."
        ]
    },
    {
        "21": [
            "Ecology and Evolutionary Biology (EE BIOL) 168 - Global Change Ecology has class ID Ecology and Evolutionary Biology (EE BIOL) 168. Ecology and Evolutionary Biology (EE BIOL) 168 - Global Change Ecology has class title Ecology and Evolutionary Biology (EE BIOL) 168. Ecology and Evolutionary Biology (EE BIOL) 168 - Global Change Ecology is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday Wednesday at 8am-9:15am.",
            "Ecology and Evolutionary Biology (EE BIOL) 105 - Biology of Invertebrates has class ID Ecology and Evolutionary Biology (EE BIOL) 105. Ecology and Evolutionary Biology (EE BIOL) 105 - Biology of Invertebrates has class title Ecology and Evolutionary Biology (EE BIOL) 105. Ecology and Evolutionary Biology (EE BIOL) 105 - Biology of Invertebrates is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "Ecology and Evolutionary Biology (EE BIOL) 148 - Biology of Marine Plants has class ID Ecology and Evolutionary Biology (EE BIOL) 148. Ecology and Evolutionary Biology (EE BIOL) 148 - Biology of Marine Plants has class title Ecology and Evolutionary Biology (EE BIOL) 148. Ecology and Evolutionary Biology (EE BIOL) 148 - Biology of Marine Plants is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Wednesday at 8am-8:50am.",
            "Ecology and Evolutionary Biology (EE BIOL) 200A - Evolutionary Biology has class ID Ecology and Evolutionary Biology (EE BIOL) 200A. Ecology and Evolutionary Biology (EE BIOL) 200A - Evolutionary Biology has class title Ecology and Evolutionary Biology (EE BIOL) 200A. Ecology and Evolutionary Biology (EE BIOL) 200A - Evolutionary Biology is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday at W.",
            "Ecology and Evolutionary Biology (EE BIOL) M232 - Evolutionary Ecology has class ID Ecology and Evolutionary Biology (EE BIOL) M232. Ecology and Evolutionary Biology (EE BIOL) M232 - Evolutionary Ecology has class title Ecology and Evolutionary Biology (EE BIOL) M232. Ecology and Evolutionary Biology (EE BIOL) M232 - Evolutionary Ecology is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:50pm."
        ]
    },
    {
        "22": [
            "African American Studies (AF AMER) 241 - Special Topics in Afro-American Studies: Blackness and Borderscapes has class ID African American Studies (AF AMER) 241. African American Studies (AF AMER) 241 - Special Topics in Afro-American Studies: Blackness and Borderscapes has class title African American Studies (AF AMER) 241. African American Studies (AF AMER) 241 - Special Topics in Afro-American Studies: Blackness and Borderscapes is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Wednesday at 12pm-2:50pm.",
            "African American Studies (AF AMER) M5 - Social Organization of Black Communities has class ID African American Studies (AF AMER) M5. African American Studies (AF AMER) M5 - Social Organization of Black Communities has class title African American Studies (AF AMER) M5. African American Studies (AF AMER) M5 - Social Organization of Black Communities is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Monday Wednesday at 12pm-1:50pm.",
            "African American Studies (AF AMER) 241 - Special Topics in Afro-American Studies: Internationalism: Paradigms, Debates, and New Directions has class ID African American Studies (AF AMER) 241. African American Studies (AF AMER) 241 - Special Topics in Afro-American Studies: Internationalism: Paradigms, Debates, and New Directions has class title African American Studies (AF AMER) 241. African American Studies (AF AMER) 241 - Special Topics in Afro-American Studies: Internationalism: Paradigms, Debates, and New Directions is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Tuesday at 4pm-6:50pm.",
            "African American Studies (AF AMER) 184B - Research in Black Life, Institutions, and Culture II has class ID African American Studies (AF AMER) 184B. African American Studies (AF AMER) 184B - Research in Black Life, Institutions, and Culture II has class title African American Studies (AF AMER) 184B. African American Studies (AF AMER) 184B - Research in Black Life, Institutions, and Culture II is offered in 1 quarters. In 2023 winter quarter, Lec 1 is offered on Tuesday at 4pm-6:50pm.",
            "African American Studies (AF AMER) 188A - Special Courses in African American Studies: Black Deejay Culture and Music Migration has class ID African American Studies (AF AMER) 188A. African American Studies (AF AMER) 188A - Special Courses in African American Studies: Black Deejay Culture and Music Migration has class title African American Studies (AF AMER) 188A. African American Studies (AF AMER) 188A - Special Courses in African American Studies: Black Deejay Culture and Music Migration is offered in 1 quarters. In 2020 fall quarter, Lec 2 is offered on Monday at 10am-12:50pm."
        ]
    },
    {
        "23": [
            "Economics (ECON) 111 - Theories of Development has class ID Economics (ECON) 111. Economics (ECON) 111 - Theories of Development has class title Economics (ECON) 111. Economics (ECON) 111 - Theories of Development is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "Economics (ECON) 162 - Monetary Policy has class ID Economics (ECON) 162. Economics (ECON) 162 - Monetary Policy has class title Economics (ECON) 162. Economics (ECON) 162 - Monetary Policy is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Monday Wednesday at 5pm-6:15pm.",
            "Education (EDUC) 202 - Evaluation Theory has class ID Education (EDUC) 202. Education (EDUC) 202 - Evaluation Theory has class title Education (EDUC) 202. Education (EDUC) 202 - Evaluation Theory is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Wednesday at 4pm-6:50pm.",
            "Economics (ECON) 401A - Microeconomic Theory has class ID Economics (ECON) 401A. Economics (ECON) 401A - Microeconomic Theory has class title Economics (ECON) 401A. Economics (ECON) 401A - Microeconomic Theory is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Tuesday Thursday at T.",
            "Anthropology (ANTHRO) 149 - Selected Topics in Social Anthropology: Political Imprisonment has class ID Anthropology (ANTHRO) 149. Anthropology (ANTHRO) 149 - Selected Topics in Social Anthropology: Political Imprisonment has class title Anthropology (ANTHRO) 149. Anthropology (ANTHRO) 149 - Selected Topics in Social Anthropology: Political Imprisonment is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday at 3:30pm-4:45pm."
        ]
    },
    {
        "24": [
            "Statistics (STATS) 401 - Survey of Methods in Modern Statistics has class ID Statistics (STATS) 401. Statistics (STATS) 401 - Survey of Methods in Modern Statistics has class title Statistics (STATS) 401. Statistics (STATS) 401 - Survey of Methods in Modern Statistics is offered in 2 quarters. In 2020 fall quarter, Lec 1 is offered on Monday at 6pm-8:50pm. In 2021 fall quarter, Lec 1 is offered on Monday at 6pm-8:50pm.",
            "Statistics (STATS) 420 - Causal Inference in Social Science Practice  has class ID Statistics (STATS) 420. Statistics (STATS) 420 - Causal Inference in Social Science Practice  has class title Statistics (STATS) 420. Statistics (STATS) 420 - Causal Inference in Social Science Practice  is offered in 1 quarters. In 2022 fall quarter, ec 80 is offered on Monday at 6pm-8:50pm.",
            "Statistics (STATS) 231C - Theories of Machine Learning has class ID Statistics (STATS) 231C. Statistics (STATS) 231C - Theories of Machine Learning has class title Statistics (STATS) 231C. Statistics (STATS) 231C - Theories of Machine Learning is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "Statistics (STATS) 400 - Introduction to Probability Modeling has class ID Statistics (STATS) 400. Statistics (STATS) 400 - Introduction to Probability Modeling has class title Statistics (STATS) 400. Statistics (STATS) 400 - Introduction to Probability Modeling is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Tuesday at 6pm-8:50pm.",
            "Statistics (STATS) M232B - Statistical Computing and Inference in Vision and Cognition has class ID Statistics (STATS) M232B. Statistics (STATS) M232B - Statistical Computing and Inference in Vision and Cognition has class title Statistics (STATS) M232B. Statistics (STATS) M232B - Statistical Computing and Inference in Vision and Cognition is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Monday Wednesday at 3:30pm-4:45pm."
        ]
    },
    {
        "25": [
            "Mathematics (MATH) 270A - Mathematical Aspects of Scientific Computing: Techniques of Scientific Computing has class ID Mathematics (MATH) 270A. Mathematics (MATH) 270A - Mathematical Aspects of Scientific Computing: Techniques of Scientific Computing has class title Mathematics (MATH) 270A. Mathematics (MATH) 270A - Mathematical Aspects of Scientific Computing: Techniques of Scientific Computing is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday Friday at 11am-11:50am.",
            "Mathematics (MATH) 191 - Variable Topics Research Seminars: Mathematics: Mathematical Approaches to Deep Learning Architectures: What Neural Networks Can Learn has class ID Mathematics (MATH) 191. Mathematics (MATH) 191 - Variable Topics Research Seminars: Mathematics: Mathematical Approaches to Deep Learning Architectures: What Neural Networks Can Learn has class title Mathematics (MATH) 191. Mathematics (MATH) 191 - Variable Topics Research Seminars: Mathematics: Mathematical Approaches to Deep Learning Architectures: What Neural Networks Can Learn is offered in 1 quarters. In 2023 spring quarter, Lec 1 is offered on Monday Wednesday Friday at 12pm-12:50pm.",
            "Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Human-Centered Artificial Intelligence Systems has class ID Electrical and Computer Engineering (EC ENGR) 209AS. Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Human-Centered Artificial Intelligence Systems has class title Electrical and Computer Engineering (EC ENGR) 209AS. Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Human-Centered Artificial Intelligence Systems is offered in 1 quarters. In 2024 winter quarter, Lec 2 is offered on Tuesday Thursday at 2pm-3:50pm.",
            "Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Computational Robotics has class ID Electrical and Computer Engineering (EC ENGR) 209AS. Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Computational Robotics has class title Electrical and Computer Engineering (EC ENGR) 209AS. Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Computational Robotics is offered in 2 quarters. In 2020 fall quarter, Lec 2 is offered on Tuesday Thursday at 2pm-3:50pm. In 2021 fall quarter, Lec 2 is offered on Thursday at T.",
            "Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Trustworthy Artificial Intelligence has class ID Electrical and Computer Engineering (EC ENGR) 209AS. Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Trustworthy Artificial Intelligence has class title Electrical and Computer Engineering (EC ENGR) 209AS. Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Trustworthy Artificial Intelligence is offered in 1 quarters. In 2024 spring quarter, Lec 3 is offered on Monday Wednesday at 4pm-5:50pm."
        ]
    },
    {
        "26": [
            "Philosophy (PHILOS) 185 - Major Philosophers of 20th Century has class ID Philosophy (PHILOS) 185. Philosophy (PHILOS) 185 - Major Philosophers of 20th Century has class title Philosophy (PHILOS) 185. Philosophy (PHILOS) 185 - Major Philosophers of 20th Century is offered in 1 quarters. In 2023 winter quarter, Lec 1 is offered on Monday Wednesday at 4pm-5:50pm.",
            "Philosophy (PHILOS) 185 - Major Philosophers of 20th Century: Wittgenstein's Philosophical Investigations has class ID Philosophy (PHILOS) 185. Philosophy (PHILOS) 185 - Major Philosophers of 20th Century: Wittgenstein's Philosophical Investigations has class title Philosophy (PHILOS) 185. Philosophy (PHILOS) 185 - Major Philosophers of 20th Century: Wittgenstein's Philosophical Investigations is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Tuesday Thursday at 4pm-5:50pm.",
            "Philosophy (PHILOS) 7 - Introduction to Philosophy of Mind has class ID Philosophy (PHILOS) 7. Philosophy (PHILOS) 7 - Introduction to Philosophy of Mind has class title Philosophy (PHILOS) 7. Philosophy (PHILOS) 7 - Introduction to Philosophy of Mind is offered in 2 quarters. In 2020 winter quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:15pm. In 2022 winter quarter, Lec 1 is offered on Monday at W.",
            "Philosophy (PHILOS) 130 - Philosophy of Space and Time has class ID Philosophy (PHILOS) 130. Philosophy (PHILOS) 130 - Philosophy of Space and Time has class title Philosophy (PHILOS) 130. Philosophy (PHILOS) 130 - Philosophy of Space and Time is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Tuesday Thursday at 11am-12:15pm.",
            "Philosophy (PHILOS) C151B - History of Ethics: Modern: Kant's Moral and Practical Philosophy has class ID Philosophy (PHILOS) C151B. Philosophy (PHILOS) C151B - History of Ethics: Modern: Kant's Moral and Practical Philosophy has class title Philosophy (PHILOS) C151B. Philosophy (PHILOS) C151B - History of Ethics: Modern: Kant's Moral and Practical Philosophy is offered in 1 quarters. In 2023 spring quarter, Lec 1 is offered on Monday Wednesday at 10am-11:50am."
        ]
    },
    {
        "27": [
            "Art History (ART HIS) 27 - Art and Architecture of Ancient Americas has class ID Art History (ART HIS) 27. Art History (ART HIS) 27 - Art and Architecture of Ancient Americas has class title Art History (ART HIS) 27. Art History (ART HIS) 27 - Art and Architecture of Ancient Americas is offered in 1 quarters. In 2021 spring quarter, Lec 1 is offered on Monday at 5pm-5:50pm.",
            "History (HIST) 9C - Introduction to Asian Civilizations: History of Japan has class ID History (HIST) 9C. History (HIST) 9C - Introduction to Asian Civilizations: History of Japan has class title History (HIST) 9C. History (HIST) 9C - Introduction to Asian Civilizations: History of Japan is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "History (HIST) 115 - Topics in Ancient History: Race and Ethnicity in Ancient Greece has class ID History (HIST) 115. History (HIST) 115 - Topics in Ancient History: Race and Ethnicity in Ancient Greece has class title History (HIST) 115. History (HIST) 115 - Topics in Ancient History: Race and Ethnicity in Ancient Greece is offered in 1 quarters. In 2023 winter quarter, Lec 1 is offered on Monday Wednesday Friday at 10am-10:50am.",
            "Art History (ART HIS) C151 - Selected Topics in Japanese Art: Introduction to Japanese Archaeology has class ID Art History (ART HIS) C151. Art History (ART HIS) C151 - Selected Topics in Japanese Art: Introduction to Japanese Archaeology has class title Art History (ART HIS) C151. Art History (ART HIS) C151 - Selected Topics in Japanese Art: Introduction to Japanese Archaeology is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "Art History (ART HIS) C140 - Selected Topics in Arts of Indigenous Americas has class ID Art History (ART HIS) C140. Art History (ART HIS) C140 - Selected Topics in Arts of Indigenous Americas has class title Art History (ART HIS) C140. Art History (ART HIS) C140 - Selected Topics in Arts of Indigenous Americas is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday at 9:30am-10:45am."
        ]
    },
    {
        "28": [
            "Nursing 291A - Applied Statistics and Analytics for Health Sciences Research I has class ID Nursing 291A. Nursing 291A - Applied Statistics and Analytics for Health Sciences Research I has class title Nursing 291A. Nursing 291A - Applied Statistics and Analytics for Health Sciences Research I is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Thursday at 8am-12pm.",
            "Nursing 291B - Applied Statistics and Analytics for Health Sciences Research II has class ID Nursing 291B. Nursing 291B - Applied Statistics and Analytics for Health Sciences Research II has class title Nursing 291B. Nursing 291B - Applied Statistics and Analytics for Health Sciences Research II is offered in 1 quarters. In 2023 spring quarter, Lec 1 is offered on Monday at 9am-11:50am.",
            "Nursing 291A - Applied Statistics and Analytics for Health Sciences Research 1 has class ID Nursing 291A. Nursing 291A - Applied Statistics and Analytics for Health Sciences Research 1 has class title Nursing 291A. Nursing 291A - Applied Statistics and Analytics for Health Sciences Research 1 is offered in 1 quarters. In 2023 winter quarter, Lec 1 is offered on Monday at 1pm-4:50pm.",
            "Management (MGMT) 298D - Special Topics in Management: Quantitative Analysis for Health Systems has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Quantitative Analysis for Health Systems has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Quantitative Analysis for Health Systems is offered in 1 quarters. In 2021 winter quarter, Lec 6 is offered on Monday at 4:10pm-7pm.",
            "Management (MGMT) 298D - Special Topics in Management: Health Care Technology Management  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Health Care Technology Management  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Health Care Technology Management  is offered in 1 quarters. In 2023 spring quarter, ec 20 is offered on Tuesday at 4:10pm-7pm."
        ]
    },
    {
        "29": [
            "History (HIST) 175A - Cultural and Political History of Contemporary South Asia has class ID History (HIST) 175A. History (HIST) 175A - Cultural and Political History of Contemporary South Asia has class title History (HIST) 175A. History (HIST) 175A - Cultural and Political History of Contemporary South Asia is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Tuesday Thursday at 12:30pm-1:45pm.",
            "History (HIST) 111C - Topics in Middle Eastern History: Modern: Politics of Minorities and Gender in Middle East has class ID History (HIST) 111C. History (HIST) 111C - Topics in Middle Eastern History: Modern: Politics of Minorities and Gender in Middle East has class title History (HIST) 111C. History (HIST) 111C - Topics in Middle Eastern History: Modern: Politics of Minorities and Gender in Middle East is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Monday Wednesday at 5pm-6:15pm.",
            "History (HIST) 132 - Topics in European History: Migration and Making of Modern Europe, 1792 to Present has class ID History (HIST) 132. History (HIST) 132 - Topics in European History: Migration and Making of Modern Europe, 1792 to Present has class title History (HIST) 132. History (HIST) 132 - Topics in European History: Migration and Making of Modern Europe, 1792 to Present is offered in 1 quarters. In 2023 spring quarter, Lec 1 is offered on Monday Wednesday Friday at 2pm-2:50pm.",
            "History (HIST) 132 - Topics in European History: War and Peace in Europe, 1700-1925 has class ID History (HIST) 132. History (HIST) 132 - Topics in European History: War and Peace in Europe, 1700-1925 has class title History (HIST) 132. History (HIST) 132 - Topics in European History: War and Peace in Europe, 1700-1925 is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Monday Wednesday at 3:30pm-4:45pm.",
            "History (HIST) 179A - Variable Topics in History of Medicine: History of Global Health Technologies has class ID History (HIST) 179A. History (HIST) 179A - Variable Topics in History of Medicine: History of Global Health Technologies has class title History (HIST) 179A. History (HIST) 179A - Variable Topics in History of Medicine: History of Global Health Technologies is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Tuesday Thursday at 9:30am-10:45am."
        ]
    },
    {
        "30": [
            "Mathematics (MATH) 205A - Number Theory has class ID Mathematics (MATH) 205A. Mathematics (MATH) 205A - Number Theory has class title Mathematics (MATH) 205A. Mathematics (MATH) 205A - Number Theory is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday Friday at 10am-10:50am.",
            "Mathematics (MATH) 238A - Dynamical Systems has class ID Mathematics (MATH) 238A. Mathematics (MATH) 238A - Dynamical Systems has class title Mathematics (MATH) 238A. Mathematics (MATH) 238A - Dynamical Systems is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday Friday at 11am-11:50am.",
            "Mathematics (MATH) 216C - Further Topics in Algebra has class ID Mathematics (MATH) 216C. Mathematics (MATH) 216C - Further Topics in Algebra has class title Mathematics (MATH) 216C. Mathematics (MATH) 216C - Further Topics in Algebra is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Monday Wednesday Friday at 11am-11:50am.",
            "Mathematics (MATH) 100 - Problem Solving has class ID Mathematics (MATH) 100. Mathematics (MATH) 100 - Problem Solving has class title Mathematics (MATH) 100. Mathematics (MATH) 100 - Problem Solving is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Monday Wednesday Friday at 10am-10:50am.",
            "Mathematics (MATH) 216B - Further Topics in Algebra has class ID Mathematics (MATH) 216B. Mathematics (MATH) 216B - Further Topics in Algebra has class title Mathematics (MATH) 216B. Mathematics (MATH) 216B - Further Topics in Algebra is offered in 1 quarters. In 2021 spring quarter, Lec 1 is offered on Monday Wednesday Friday at 2pm-2:50pm."
        ]
    },
    {
        "31": [
            "Mathematics (MATH) 216C - Further Topics in Algebra has class ID Mathematics (MATH) 216C. Mathematics (MATH) 216C - Further Topics in Algebra has class title Mathematics (MATH) 216C. Mathematics (MATH) 216C - Further Topics in Algebra is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Monday Wednesday Friday at 11am-11:50am.",
            "Mathematics (MATH) 100 - Problem Solving has class ID Mathematics (MATH) 100. Mathematics (MATH) 100 - Problem Solving has class title Mathematics (MATH) 100. Mathematics (MATH) 100 - Problem Solving is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Monday Wednesday Friday at 10am-10:50am.",
            "Mathematics (MATH) 216B - Further Topics in Algebra has class ID Mathematics (MATH) 216B. Mathematics (MATH) 216B - Further Topics in Algebra has class title Mathematics (MATH) 216B. Mathematics (MATH) 216B - Further Topics in Algebra is offered in 1 quarters. In 2021 spring quarter, Lec 1 is offered on Monday Wednesday Friday at 2pm-2:50pm.",
            "Mathematics (MATH) 205A - Number Theory has class ID Mathematics (MATH) 205A. Mathematics (MATH) 205A - Number Theory has class title Mathematics (MATH) 205A. Mathematics (MATH) 205A - Number Theory is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday Friday at 10am-10:50am.",
            "Mathematics (MATH) 101 - Advanced Problem Solving has class ID Mathematics (MATH) 101. Mathematics (MATH) 101 - Advanced Problem Solving has class title Mathematics (MATH) 101. Mathematics (MATH) 101 - Advanced Problem Solving is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Monday at 4pm-6:50pm."
        ]
    },
    {
        "32": [
            "Management (MGMT) 298D - Special Topics in Management: Quantitative Analysis for Health Systems has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Quantitative Analysis for Health Systems has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Quantitative Analysis for Health Systems is offered in 1 quarters. In 2021 winter quarter, Lec 6 is offered on Monday at 4:10pm-7pm.",
            "Management (MGMT) 298D - Special Topics in Management: Corporate Governance  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance  is offered in 1 quarters. In 2022 winter quarter, ec 15 is offered on Wednesday at 7:10pm-10pm.",
            "Management (MGMT) 298D - Special Topics in Management: Corporate Governance has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance is offered in 1 quarters. In 2023 spring quarter, Lec 7 is offered on Wednesday at 7:10pm-10pm.",
            "Management (MGMT) 298D - Special Topics in Management has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management is offered in 1 quarters. In 2022 fall quarter, Lec 5 is offered on Wednesday at 4:10pm-7pm.",
            "Management (MGMT) 298D - Special Topics in Management: Judgement and Decision Making has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Judgement and Decision Making has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Judgement and Decision Making is offered in 1 quarters. In 2020 fall quarter, Lec 2 is offered on Monday at 1pm-4pm."
        ]
    },
    {
        "33": [
            "History (HIST) 125D - History of Low Countries has class ID History (HIST) 125D. History (HIST) 125D - History of Low Countries has class title History (HIST) 125D. History (HIST) 125D - History of Low Countries is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "History (HIST) 144 - America in World has class ID History (HIST) 144. History (HIST) 144 - America in World has class title History (HIST) 144. History (HIST) 144 - America in World is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Monday Wednesday Friday at 12pm-12:50pm.",
            "History (HIST) 174B - History of British India I has class ID History (HIST) 174B. History (HIST) 174B - History of British India I has class title History (HIST) 174B. History (HIST) 174B - History of British India I is offered in 1 quarters. In 2021 spring quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "History (HIST) 12A - Inequality: History of Mass Imprisonment has class ID History (HIST) 12A. History (HIST) 12A - Inequality: History of Mass Imprisonment has class title History (HIST) 12A. History (HIST) 12A - Inequality: History of Mass Imprisonment is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Tuesday Thursday at 3:30pm-4:45pm.",
            "History (HIST) 174F - Gandhi and Making of Modern India has class ID History (HIST) 174F. History (HIST) 174F - Gandhi and Making of Modern India has class title History (HIST) 174F. History (HIST) 174F - Gandhi and Making of Modern India is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:15pm."
        ]
    },
    {
        "34": [
            "Education (EDUC) 225A - Issues in Education of Exceptional Individuals has class ID Education (EDUC) 225A. Education (EDUC) 225A - Issues in Education of Exceptional Individuals has class title Education (EDUC) 225A. Education (EDUC) 225A - Issues in Education of Exceptional Individuals is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday at 8am-11:50am.",
            "Education (EDUC) 151 - Quantitative Research in Education: Measurement and Assessment has class ID Education (EDUC) 151. Education (EDUC) 151 - Quantitative Research in Education: Measurement and Assessment has class title Education (EDUC) 151. Education (EDUC) 151 - Quantitative Research in Education: Measurement and Assessment is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Tuesday at R.",
            "Education (EDUC) 202 - Evaluation Theory has class ID Education (EDUC) 202. Education (EDUC) 202 - Evaluation Theory has class title Education (EDUC) 202. Education (EDUC) 202 - Evaluation Theory is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Wednesday at 4pm-6:50pm.",
            "Education (EDUC) 200B - Survey Research Methods in Education has class ID Education (EDUC) 200B. Education (EDUC) 200B - Survey Research Methods in Education has class title Education (EDUC) 200B. Education (EDUC) 200B - Survey Research Methods in Education is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:50pm.",
            "Education (EDUC) 231A - Toolkit for Quantitative Methods Research has class ID Education (EDUC) 231A. Education (EDUC) 231A - Toolkit for Quantitative Methods Research has class title Education (EDUC) 231A. Education (EDUC) 231A - Toolkit for Quantitative Methods Research is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday at 10am-11:50am."
        ]
    },
    {
        "35": [
            "Communication (COMM) 123 - Social Cognition has class ID Communication (COMM) 123. Communication (COMM) 123 - Social Cognition has class title Communication (COMM) 123. Communication (COMM) 123 - Social Cognition is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "Spanish (SPAN) 100B - Introduction to Study of Spanish Grammar: Syntax has class ID Spanish (SPAN) 100B. Spanish (SPAN) 100B - Introduction to Study of Spanish Grammar: Syntax has class title Spanish (SPAN) 100B. Spanish (SPAN) 100B - Introduction to Study of Spanish Grammar: Syntax is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Tuesday Thursday at 4pm-5:50pm.",
            "Sociology (SOCIOL) 205 - Family and Social Change has class ID Sociology (SOCIOL) 205. Sociology (SOCIOL) 205 - Family and Social Change has class title Sociology (SOCIOL) 205. Sociology (SOCIOL) 205 - Family and Social Change is offered in 1 quarters. In 2023 spring quarter, Lec 1 is offered on Monday at 12pm-2:50pm.",
            "Philosophy (PHILOS) 130 - Philosophy of Space and Time has class ID Philosophy (PHILOS) 130. Philosophy (PHILOS) 130 - Philosophy of Space and Time has class title Philosophy (PHILOS) 130. Philosophy (PHILOS) 130 - Philosophy of Space and Time is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Tuesday Thursday at 11am-12:15pm.",
            "Philosophy (PHILOS) C127C - Philosophy of Language: Naming and Necessity has class ID Philosophy (PHILOS) C127C. Philosophy (PHILOS) C127C - Philosophy of Language: Naming and Necessity has class title Philosophy (PHILOS) C127C. Philosophy (PHILOS) C127C - Philosophy of Language: Naming and Necessity is offered in 1 quarters. In 2023 spring quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:50pm."
        ]
    },
    {
        "36": [
            "Psychology (PSYCH) 119P - Emerging Topics in Neuroscience has class ID Psychology (PSYCH) 119P. Psychology (PSYCH) 119P - Emerging Topics in Neuroscience has class title Psychology (PSYCH) 119P. Psychology (PSYCH) 119P - Emerging Topics in Neuroscience is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Tuesday at R.",
            "English (ENGL) 106 - Studies in Native American and Indigenous Literatures: Indigenous Literature of North America has class ID English (ENGL) 106. English (ENGL) 106 - Studies in Native American and Indigenous Literatures: Indigenous Literature of North America has class title English (ENGL) 106. English (ENGL) 106 - Studies in Native American and Indigenous Literatures: Indigenous Literature of North America is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Tuesday Thursday at TR.",
            "Information Studies (INF STD) 180 - Special Topics in Information Studies: Algorithms and Activism has class ID Information Studies (INF STD) 180. Information Studies (INF STD) 180 - Special Topics in Information Studies: Algorithms and Activism has class title Information Studies (INF STD) 180. Information Studies (INF STD) 180 - Special Topics in Information Studies: Algorithms and Activism is offered in 2 quarters. In 2020 winter quarter, Lec 1 is offered on Tuesday at 1:30pm-5pm. In 2023 spring quarter, Lec 1 is offered on Tuesday at 1:30pm-5pm.",
            "English (ENGL) 118A - Interdisciplinary Studies in Literature: Psychoanalysis, Film, and Literature has class ID English (ENGL) 118A. English (ENGL) 118A - Interdisciplinary Studies in Literature: Psychoanalysis, Film, and Literature has class title English (ENGL) 118A. English (ENGL) 118A - Interdisciplinary Studies in Literature: Psychoanalysis, Film, and Literature is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:50pm.",
            "English (ENGL) 106 - Studies in Native American and Indigenous Literatures: Indigenous Literatures of North America has class ID English (ENGL) 106. English (ENGL) 106 - Studies in Native American and Indigenous Literatures: Indigenous Literatures of North America has class title English (ENGL) 106. English (ENGL) 106 - Studies in Native American and Indigenous Literatures: Indigenous Literatures of North America is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday Wednesday at 4pm-5:50pm."
        ]
    },
    {
        "37": [
            "Anthropology (ANTHRO) 159 - Selected Topics in Linguistic Anthropology: Language and Climate Change has class ID Anthropology (ANTHRO) 159. Anthropology (ANTHRO) 159 - Selected Topics in Linguistic Anthropology: Language and Climate Change has class title Anthropology (ANTHRO) 159. Anthropology (ANTHRO) 159 - Selected Topics in Linguistic Anthropology: Language and Climate Change is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Tuesday Thursday at 12:30pm-1:45pm.",
            "Anthropology (ANTHRO) 119 - Selected Topics in Archaeology: Archaeology of Extinction has class ID Anthropology (ANTHRO) 119. Anthropology (ANTHRO) 119 - Selected Topics in Archaeology: Archaeology of Extinction has class title Anthropology (ANTHRO) 119. Anthropology (ANTHRO) 119 - Selected Topics in Archaeology: Archaeology of Extinction is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Tuesday Thursday at 12:30pm-1:45pm.",
            "Anthropology (ANTHRO) M148 - (When) Do Leaders Make Differences? has class ID Anthropology (ANTHRO) M148. Anthropology (ANTHRO) M148 - (When) Do Leaders Make Differences? has class title Anthropology (ANTHRO) M148. Anthropology (ANTHRO) M148 - (When) Do Leaders Make Differences? is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Wednesday at 10am-10:50am.",
            "Anthropology (ANTHRO) 119 - Selected Topics in Archaeology: Archaeology of Apocalypse has class ID Anthropology (ANTHRO) 119. Anthropology (ANTHRO) 119 - Selected Topics in Archaeology: Archaeology of Apocalypse has class title Anthropology (ANTHRO) 119. Anthropology (ANTHRO) 119 - Selected Topics in Archaeology: Archaeology of Apocalypse is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Monday Wednesday at 9:30am-10:45am.",
            "Anthropology (ANTHRO) 149 - Selected Topics in Social Anthropology: Political Imprisonment has class ID Anthropology (ANTHRO) 149. Anthropology (ANTHRO) 149 - Selected Topics in Social Anthropology: Political Imprisonment has class title Anthropology (ANTHRO) 149. Anthropology (ANTHRO) 149 - Selected Topics in Social Anthropology: Political Imprisonment is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday at 3:30pm-4:45pm."
        ]
    },
    {
        "38": [
            "Ecology and Evolutionary Biology (EE BIOL) 148 - Biology of Marine Plants has class ID Ecology and Evolutionary Biology (EE BIOL) 148. Ecology and Evolutionary Biology (EE BIOL) 148 - Biology of Marine Plants has class title Ecology and Evolutionary Biology (EE BIOL) 148. Ecology and Evolutionary Biology (EE BIOL) 148 - Biology of Marine Plants is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Wednesday at 8am-8:50am.",
            "Ecology and Evolutionary Biology (EE BIOL) 105 - Biology of Invertebrates has class ID Ecology and Evolutionary Biology (EE BIOL) 105. Ecology and Evolutionary Biology (EE BIOL) 105 - Biology of Invertebrates has class title Ecology and Evolutionary Biology (EE BIOL) 105. Ecology and Evolutionary Biology (EE BIOL) 105 - Biology of Invertebrates is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "Ecology and Evolutionary Biology (EE BIOL) 117 - Evolution of Vertebrates has class ID Ecology and Evolutionary Biology (EE BIOL) 117. Ecology and Evolutionary Biology (EE BIOL) 117 - Evolution of Vertebrates has class title Ecology and Evolutionary Biology (EE BIOL) 117. Ecology and Evolutionary Biology (EE BIOL) 117 - Evolution of Vertebrates is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Tuesday Thursday at 11am-12:15pm.",
            "Ecology and Evolutionary Biology (EE BIOL) 200A - Evolutionary Biology has class ID Ecology and Evolutionary Biology (EE BIOL) 200A. Ecology and Evolutionary Biology (EE BIOL) 200A - Evolutionary Biology has class title Ecology and Evolutionary Biology (EE BIOL) 200A. Ecology and Evolutionary Biology (EE BIOL) 200A - Evolutionary Biology is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday at W.",
            "Ecology and Evolutionary Biology (EE BIOL) 123B - Field Marine Ecology has class ID Ecology and Evolutionary Biology (EE BIOL) 123B. Ecology and Evolutionary Biology (EE BIOL) 123B - Field Marine Ecology has class title Ecology and Evolutionary Biology (EE BIOL) 123B. Ecology and Evolutionary Biology (EE BIOL) 123B - Field Marine Ecology is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Tuesday at 8am-8:50am."
        ]
    },
    {
        "39": [
            "Linguistics (LING) 204C - Speech Perception has class ID Linguistics (LING) 204C. Linguistics (LING) 204C - Speech Perception has class title Linguistics (LING) 204C. Linguistics (LING) 204C - Speech Perception is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Tuesday Thursday at 10am-11:50am.",
            "Urban Planning (URBN PL) 265C - Food Systems has class ID Urban Planning (URBN PL) 265C. Urban Planning (URBN PL) 265C - Food Systems has class title Urban Planning (URBN PL) 265C. Urban Planning (URBN PL) 265C - Food Systems is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Wednesday at 2pm-4:50pm.",
            "Urban Planning (URBN PL) 229 - Special Topics in Planning Methods: Zoning for Equity has class ID Urban Planning (URBN PL) 229. Urban Planning (URBN PL) 229 - Special Topics in Planning Methods: Zoning for Equity has class title Urban Planning (URBN PL) 229. Urban Planning (URBN PL) 229 - Special Topics in Planning Methods: Zoning for Equity is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Thursday at 2pm-4:50pm.",
            "Art 132 - Survey of Critical Thought: Critical Human has class ID Art 132. Art 132 - Survey of Critical Thought: Critical Human has class title Art 132. Art 132 - Survey of Critical Thought: Critical Human is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Wednesday at 6:30pm-9:20pm.",
            "History (HIST) 144 - America in World has class ID History (HIST) 144. History (HIST) 144 - America in World has class title History (HIST) 144. History (HIST) 144 - America in World is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Monday Wednesday Friday at 12pm-12:50pm."
        ]
    },
    {
        "40": [
            "Education (EDUC) 188B - Transformative Research in Community-Based Settings has class ID Education (EDUC) 188B. Education (EDUC) 188B - Transformative Research in Community-Based Settings has class title Education (EDUC) 188B. Education (EDUC) 188B - Transformative Research in Community-Based Settings is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Wednesday at 12pm-3:50pm.",
            "Education (EDUC) 160 - Transformative Research in Community-Based Settings has class ID Education (EDUC) 160. Education (EDUC) 160 - Transformative Research in Community-Based Settings has class title Education (EDUC) 160. Education (EDUC) 160 - Transformative Research in Community-Based Settings is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Tuesday Thursday at 12pm-1:50pm.",
            "Education (EDUC) 188A - Transformative Research in Community-Based Settings has class ID Education (EDUC) 188A. Education (EDUC) 188A - Transformative Research in Community-Based Settings has class title Education (EDUC) 188A. Education (EDUC) 188A - Transformative Research in Community-Based Settings is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Wednesday at 12pm-3:50pm.",
            "Education (EDUC) 112 - Black Student Activism: History of Resistance on Campus has class ID Education (EDUC) 112. Education (EDUC) 112 - Black Student Activism: History of Resistance on Campus has class title Education (EDUC) 112. Education (EDUC) 112 - Black Student Activism: History of Resistance on Campus is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Wednesday at 9am-11:50am.",
            "Education (EDUC) 296H - Research Topics in Education: Organizational Theory has class ID Education (EDUC) 296H. Education (EDUC) 296H - Research Topics in Education: Organizational Theory has class title Education (EDUC) 296H. Education (EDUC) 296H - Research Topics in Education: Organizational Theory is offered in 1 quarters. In 2024 spring quarter, Lec 2 is offered on Tuesday at 6pm-8:50pm."
        ]
    },
    {
        "41": [
            "Chemistry and Biochemistry (CHEM) C222 - Mathematical Methods for Chemistry has class ID Chemistry and Biochemistry (CHEM) C222. Chemistry and Biochemistry (CHEM) C222 - Mathematical Methods for Chemistry has class title Chemistry and Biochemistry (CHEM) C222. Chemistry and Biochemistry (CHEM) C222 - Mathematical Methods for Chemistry is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday Friday at 10am-10:50am.",
            "Chemistry and Biochemistry (CHEM) 136 - Organic Structural Methods has class ID Chemistry and Biochemistry (CHEM) 136. Chemistry and Biochemistry (CHEM) 136 - Organic Structural Methods has class title Chemistry and Biochemistry (CHEM) 136. Chemistry and Biochemistry (CHEM) 136 - Organic Structural Methods is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Thursday at 12pm-1:50pm.",
            "Chemistry and Biochemistry (CHEM) C122 - Mathematical Methods for Chemistry has class ID Chemistry and Biochemistry (CHEM) C122. Chemistry and Biochemistry (CHEM) C122 - Mathematical Methods for Chemistry has class title Chemistry and Biochemistry (CHEM) C122. Chemistry and Biochemistry (CHEM) C122 - Mathematical Methods for Chemistry is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday Friday at 10am-10:50am.",
            "Chemistry and Biochemistry (CHEM) C126A - Computational Methods for Chemists has class ID Chemistry and Biochemistry (CHEM) C126A. Chemistry and Biochemistry (CHEM) C126A - Computational Methods for Chemists has class title Chemistry and Biochemistry (CHEM) C126A. Chemistry and Biochemistry (CHEM) C126A - Computational Methods for Chemists is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:50pm.",
            "Chemistry and Biochemistry (CHEM) 103 - Environmental Chemistry has class ID Chemistry and Biochemistry (CHEM) 103. Chemistry and Biochemistry (CHEM) 103 - Environmental Chemistry has class title Chemistry and Biochemistry (CHEM) 103. Chemistry and Biochemistry (CHEM) 103 - Environmental Chemistry is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Monday Wednesday Friday at 3pm-3:50pm."
        ]
    },
    {
        "42": [
            "English (ENGL) M104C - African American Literature of 1960s and 1970s has class ID English (ENGL) M104C. English (ENGL) M104C - African American Literature of 1960s and 1970s has class title English (ENGL) M104C. English (ENGL) M104C - African American Literature of 1960s and 1970s is offered in 1 quarters. In 2023 winter quarter, Lec 1 is offered on Tuesday Thursday at 8am-9:50am.",
            "African American Studies (AF AMER) M5 - Social Organization of Black Communities has class ID African American Studies (AF AMER) M5. African American Studies (AF AMER) M5 - Social Organization of Black Communities has class title African American Studies (AF AMER) M5. African American Studies (AF AMER) M5 - Social Organization of Black Communities is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Monday Wednesday at 12pm-1:50pm.",
            "English (ENGL) M104D - Contemporary African American Literature has class ID English (ENGL) M104D. English (ENGL) M104D - Contemporary African American Literature has class title English (ENGL) M104D. English (ENGL) M104D - Contemporary African American Literature is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:50pm.",
            "African American Studies (AF AMER) M104C - African American Literature of 1960s and 1970s has class ID African American Studies (AF AMER) M104C. African American Studies (AF AMER) M104C - African American Literature of 1960s and 1970s has class title African American Studies (AF AMER) M104C. African American Studies (AF AMER) M104C - African American Literature of 1960s and 1970s is offered in 1 quarters. In 2023 winter quarter, Lec 1 is offered on Tuesday Thursday at 8am-9:50am.",
            "African American Studies (AF AMER) M104D - Contemporary African American Literature has class ID African American Studies (AF AMER) M104D. African American Studies (AF AMER) M104D - Contemporary African American Literature has class title African American Studies (AF AMER) M104D. African American Studies (AF AMER) M104D - Contemporary African American Literature is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:50pm."
        ]
    },
    {
        "43": [
            "Theater 216A - Approaches to Representation has class ID Theater 216A. Theater 216A - Approaches to Representation has class title Theater 216A. Theater 216A - Approaches to Representation is offered in 2 quarters. In 2022 winter quarter, Lec 1 is offered on Monday at 1pm-3:50pm. In 2024 winter quarter, Lec 1 is offered on Tuesday at 9am-11:50am.",
            "Theater 441B - Lighting Design has class ID Theater 441B. Theater 441B - Lighting Design has class title Theater 441B. Theater 441B - Lighting Design is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday at 9am-12:50pm.",
            "Theater 442A - Costume Design has class ID Theater 442A. Theater 442A - Costume Design has class title Theater 442A. Theater 442A - Costume Design is offered in 1 quarters. In 2021 fall quarter, Lec 1 is offered on Friday at 9am-12:50pm.",
            "History (HIST) 144 - America in World has class ID History (HIST) 144. History (HIST) 144 - America in World has class title History (HIST) 144. History (HIST) 144 - America in World is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Monday Wednesday Friday at 12pm-12:50pm.",
            "Theater 101B - Global Histories of Theater and Performance II has class ID Theater 101B. Theater 101B - Global Histories of Theater and Performance II has class title Theater 101B. Theater 101B - Global Histories of Theater and Performance II is offered in 3 quarters. In 2022 spring quarter, Lec 1 is offered on Monday at F. In 2023 spring quarter, Lec 1 is offered on Tuesday Thursday at 4pm-5:50pm. In 2024 spring quarter, Lec 1 is offered on Tuesday Thursday at 4pm-5:30pm."
        ]
    },
    {
        "44": [
            "Education (EDUC) 231A - Toolkit for Quantitative Methods Research has class ID Education (EDUC) 231A. Education (EDUC) 231A - Toolkit for Quantitative Methods Research has class title Education (EDUC) 231A. Education (EDUC) 231A - Toolkit for Quantitative Methods Research is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday at 10am-11:50am.",
            "Education (EDUC) 150 - Introduction to Quantitative Research in Education: Claims and Evidence has class ID Education (EDUC) 150. Education (EDUC) 150 - Introduction to Quantitative Research in Education: Claims and Evidence has class title Education (EDUC) 150. Education (EDUC) 150 - Introduction to Quantitative Research in Education: Claims and Evidence is offered in 2 quarters. In 2020 fall quarter, Lec 1 is offered on Monday Wednesday at 10am-11:50am. In 2020 spring quarter, Lec 1 is offered on Tuesday at 12pm-1:50pm.",
            "Education (EDUC) 230A - Introduction to Research Design and Statistics has class ID Education (EDUC) 230A. Education (EDUC) 230A - Introduction to Research Design and Statistics has class title Education (EDUC) 230A. Education (EDUC) 230A - Introduction to Research Design and Statistics is offered in 2 quarters. In 2021 fall quarter, Lec 1 is offered on Monday at W, and Lec 2 is offered on Monday at W. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday at 10am-11:50am, and Lec 2 is offered on Monday Wednesday at 1pm-2:50pm.",
            "Education (EDUC) 200B - Survey Research Methods in Education has class ID Education (EDUC) 200B. Education (EDUC) 200B - Survey Research Methods in Education has class title Education (EDUC) 200B. Education (EDUC) 200B - Survey Research Methods in Education is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:50pm.",
            "Education (EDUC) 188B - Transformative Research in Community-Based Settings has class ID Education (EDUC) 188B. Education (EDUC) 188B - Transformative Research in Community-Based Settings has class title Education (EDUC) 188B. Education (EDUC) 188B - Transformative Research in Community-Based Settings is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Wednesday at 12pm-3:50pm."
        ]
    },
    {
        "45": [
            "Philosophy (PHILOS) M152B - Topics in Moral Philosophy: Evil: Nature, Source, and Motivation of Evil has class ID Philosophy (PHILOS) M152B. Philosophy (PHILOS) M152B - Topics in Moral Philosophy: Evil: Nature, Source, and Motivation of Evil has class title Philosophy (PHILOS) M152B. Philosophy (PHILOS) M152B - Topics in Moral Philosophy: Evil: Nature, Source, and Motivation of Evil is offered in 1 quarters. In 2023 winter quarter, Lec 1 is offered on Monday Wednesday at 8am-9:50am.",
            "Religion, Study of (RELIGN) M155 - Angels, Demons, and End of World: Magic, Mysticism, and Apocalypse in Jewish Traditions has class ID Religion, Study of (RELIGN) M155. Religion, Study of (RELIGN) M155 - Angels, Demons, and End of World: Magic, Mysticism, and Apocalypse in Jewish Traditions has class title Religion, Study of (RELIGN) M155. Religion, Study of (RELIGN) M155 - Angels, Demons, and End of World: Magic, Mysticism, and Apocalypse in Jewish Traditions is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Tuesday Thursday at 12:30pm-1:45pm.",
            "Religion, Study of (RELIGN) 113 - In Search of Meaning: From Holy Texts to Hollywood has class ID Religion, Study of (RELIGN) 113. Religion, Study of (RELIGN) 113 - In Search of Meaning: From Holy Texts to Hollywood has class title Religion, Study of (RELIGN) 113. Religion, Study of (RELIGN) 113 - In Search of Meaning: From Holy Texts to Hollywood is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:15pm.",
            "Art 132 - Survey of Critical Thought: Critical Human has class ID Art 132. Art 132 - Survey of Critical Thought: Critical Human has class title Art 132. Art 132 - Survey of Critical Thought: Critical Human is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Wednesday at 6:30pm-9:20pm.",
            "Religion, Study of (RELIGN) 158 - The Bible in Justice Movements has class ID Religion, Study of (RELIGN) 158. Religion, Study of (RELIGN) 158 - The Bible in Justice Movements has class title Religion, Study of (RELIGN) 158. Religion, Study of (RELIGN) 158 - The Bible in Justice Movements is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Tuesday Thursday at 3:30pm-4:45pm."
        ]
    },
    {
        "46": [
            "Electrical and Computer Engineering (EC ENGR) 236C - Optimization Methods for Large-Scale Systems has class ID Electrical and Computer Engineering (EC ENGR) 236C. Electrical and Computer Engineering (EC ENGR) 236C - Optimization Methods for Large-Scale Systems has class title Electrical and Computer Engineering (EC ENGR) 236C. Electrical and Computer Engineering (EC ENGR) 236C - Optimization Methods for Large-Scale Systems is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:50pm.",
            "Electrical and Computer Engineering (EC ENGR) 279AS - Special Topics in Physical and Wave Electronics: Physics, AI, and Algorithmic Imaging has class ID Electrical and Computer Engineering (EC ENGR) 279AS. Electrical and Computer Engineering (EC ENGR) 279AS - Special Topics in Physical and Wave Electronics: Physics, AI, and Algorithmic Imaging has class title Electrical and Computer Engineering (EC ENGR) 279AS. Electrical and Computer Engineering (EC ENGR) 279AS - Special Topics in Physical and Wave Electronics: Physics, AI, and Algorithmic Imaging is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Monday Wednesday at 6pm-7:50pm.",
            "Electrical and Computer Engineering (EC ENGR) 239AS - Special Topics in Signals and Systems: Control, Identification, and Learning Algorithms has class ID Electrical and Computer Engineering (EC ENGR) 239AS. Electrical and Computer Engineering (EC ENGR) 239AS - Special Topics in Signals and Systems: Control, Identification, and Learning Algorithms has class title Electrical and Computer Engineering (EC ENGR) 239AS. Electrical and Computer Engineering (EC ENGR) 239AS - Special Topics in Signals and Systems: Control, Identification, and Learning Algorithms is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday Wednesday at 8am-9:50am.",
            "Society and Genetics (SOC GEN) 131 - Data, Artificial Intelligence, and Algorithms in the Biosciences has class ID Society and Genetics (SOC GEN) 131. Society and Genetics (SOC GEN) 131 - Data, Artificial Intelligence, and Algorithms in the Biosciences has class title Society and Genetics (SOC GEN) 131. Society and Genetics (SOC GEN) 131 - Data, Artificial Intelligence, and Algorithms in the Biosciences is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:15pm.",
            "Electrical and Computer Engineering (EC ENGR) 262 - Antenna Theory and Design has class ID Electrical and Computer Engineering (EC ENGR) 262. Electrical and Computer Engineering (EC ENGR) 262 - Antenna Theory and Design has class title Electrical and Computer Engineering (EC ENGR) 262. Electrical and Computer Engineering (EC ENGR) 262 - Antenna Theory and Design is offered in 1 quarters. In 2021 fall quarter, Lec 1 is offered on Tuesday Thursday at 10am-11:50am."
        ]
    },
    {
        "47": [
            "Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Security and Privacy for Embedded Systems, Cyber-Physical Systems, and Internet of Things has class ID Electrical and Computer Engineering (EC ENGR) 209AS. Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Security and Privacy for Embedded Systems, Cyber-Physical Systems, and Internet of Things has class title Electrical and Computer Engineering (EC ENGR) 209AS. Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Security and Privacy for Embedded Systems, Cyber-Physical Systems, and Internet of Things is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:50pm.",
            "Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Secure Computer Architecture and Hardware Design has class ID Electrical and Computer Engineering (EC ENGR) 209AS. Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Secure Computer Architecture and Hardware Design has class title Electrical and Computer Engineering (EC ENGR) 209AS. Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Secure Computer Architecture and Hardware Design is offered in 1 quarters. In 2021 spring quarter, Lec 2 is offered on Tuesday Thursday at 12pm-1:50pm.",
            "Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Human-Centered Artificial Intelligence Systems has class ID Electrical and Computer Engineering (EC ENGR) 209AS. Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Human-Centered Artificial Intelligence Systems has class title Electrical and Computer Engineering (EC ENGR) 209AS. Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Human-Centered Artificial Intelligence Systems is offered in 1 quarters. In 2024 winter quarter, Lec 2 is offered on Tuesday Thursday at 2pm-3:50pm.",
            "Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Artificial Intelligence and Machine Learning for Cyber-Physical Systems and Internet of Things has class ID Electrical and Computer Engineering (EC ENGR) 209AS. Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Artificial Intelligence and Machine Learning for Cyber-Physical Systems and Internet of Things has class title Electrical and Computer Engineering (EC ENGR) 209AS. Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Artificial Intelligence and Machine Learning for Cyber-Physical Systems and Internet of Things is offered in 1 quarters. In 2022 spring quarter, Lec 2 is offered on Monday Wednesday at 4pm-5:50pm.",
            "Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Design and Experimental Verification of CMOS Circuits has class ID Electrical and Computer Engineering (EC ENGR) 209AS. Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Design and Experimental Verification of CMOS Circuits has class title Electrical and Computer Engineering (EC ENGR) 209AS. Electrical and Computer Engineering (EC ENGR) 209AS - Special Topics in Circuits and Embedded Systems: Design and Experimental Verification of CMOS Circuits is offered in 1 quarters. In 2024 spring quarter, Lec 4 is offered on Monday Wednesday at 10am-11:50am."
        ]
    },
    {
        "48": [
            "Art 132 - Survey of Critical Thought: Critical Human has class ID Art 132. Art 132 - Survey of Critical Thought: Critical Human has class title Art 132. Art 132 - Survey of Critical Thought: Critical Human is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Wednesday at 6:30pm-9:20pm.",
            "Art History (ART HIS) 251B - Japanese Art: Time and Narrative has class ID Art History (ART HIS) 251B. Art History (ART HIS) 251B - Japanese Art: Time and Narrative has class title Art History (ART HIS) 251B. Art History (ART HIS) 251B - Japanese Art: Time and Narrative is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Thursday at 11am-1:50pm.",
            "Art M185 - Whose Monument Where: Course on Public Art has class ID Art M185. Art M185 - Whose Monument Where: Course on Public Art has class title Art M185. Art M185 - Whose Monument Where: Course on Public Art is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Tuesday Thursday at 11am-12:15pm.",
            "Urban Planning (URBN PL) 241 - Policing through Bureaucracy: Encounters with City and State has class ID Urban Planning (URBN PL) 241. Urban Planning (URBN PL) 241 - Policing through Bureaucracy: Encounters with City and State has class title Urban Planning (URBN PL) 241. Urban Planning (URBN PL) 241 - Policing through Bureaucracy: Encounters with City and State is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Thursday at 2pm-4:50pm.",
            "Art 132 - Survey of Critical Thought has class ID Art 132. Art 132 - Survey of Critical Thought has class title Art 132. Art 132 - Survey of Critical Thought is offered in 2 quarters. In 2021 spring quarter, Lec 1 is offered on Friday at 12pm-2:50pm. In 2022 winter quarter, Lec 1 is offered on Tuesday at 6:30pm-9:20pm."
        ]
    },
    {
        "49": [
            "Religion, Study of (RELIGN) M185D - Religions of Ancient Near East has class ID Religion, Study of (RELIGN) M185D. Religion, Study of (RELIGN) M185D - Religions of Ancient Near East has class title Religion, Study of (RELIGN) M185D. Religion, Study of (RELIGN) M185D - Religions of Ancient Near East is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Tuesday Thursday at 3:30pm-4:45pm.",
            "Art History (ART HIS) M110D - Art and Death in Ancient Egypt has class ID Art History (ART HIS) M110D. Art History (ART HIS) M110D - Art and Death in Ancient Egypt has class title Art History (ART HIS) M110D. Art History (ART HIS) M110D - Art and Death in Ancient Egypt is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Tuesday at 10am-12:50pm.",
            "Art History (ART HIS) M111 - Minoan Art and Archaeology has class ID Art History (ART HIS) M111. Art History (ART HIS) M111 - Minoan Art and Archaeology has class title Art History (ART HIS) M111. Art History (ART HIS) M111 - Minoan Art and Archaeology is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Tuesday Thursday at 9:30am-10:45am.",
            "Art History (ART HIS) M112A - Mycenaean Art and Archaeology has class ID Art History (ART HIS) M112A. Art History (ART HIS) M112A - Mycenaean Art and Archaeology has class title Art History (ART HIS) M112A. Art History (ART HIS) M112A - Mycenaean Art and Archaeology is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Tuesday Thursday at 11am-12:15pm.",
            "Religion, Study of (RELIGN) 113 - In Search of Meaning: From Holy Texts to Hollywood has class ID Religion, Study of (RELIGN) 113. Religion, Study of (RELIGN) 113 - In Search of Meaning: From Holy Texts to Hollywood has class title Religion, Study of (RELIGN) 113. Religion, Study of (RELIGN) 113 - In Search of Meaning: From Holy Texts to Hollywood is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:15pm."
        ]
    },
    {
        "50": [
            "History (HIST) 179B - History of Medicine: Foundations of Modern Medicine: The Making of Modern Medicine: Body, Medical Encounters, and Imperialism has class ID History (HIST) 179B. History (HIST) 179B - History of Medicine: Foundations of Modern Medicine: The Making of Modern Medicine: Body, Medical Encounters, and Imperialism has class title History (HIST) 179B. History (HIST) 179B - History of Medicine: Foundations of Modern Medicine: The Making of Modern Medicine: Body, Medical Encounters, and Imperialism is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Monday Wednesday Friday at 2pm-2:50pm.",
            "Spanish (SPAN) 150 - Topics in Contemporary Studies: Tortured Cities: Cultural Representations of Mining Terror in South America has class ID Spanish (SPAN) 150. Spanish (SPAN) 150 - Topics in Contemporary Studies: Tortured Cities: Cultural Representations of Mining Terror in South America has class title Spanish (SPAN) 150. Spanish (SPAN) 150 - Topics in Contemporary Studies: Tortured Cities: Cultural Representations of Mining Terror in South America is offered in 1 quarters. In 2021 fall quarter, Lec 3 is offered on Monday Wednesday at 12pm-1:50pm.",
            "English (ENGL) 133 - Transatlantic Literatures and Cultures: Technology and Racial Difference in Age of Colonialism has class ID English (ENGL) 133. English (ENGL) 133 - Transatlantic Literatures and Cultures: Technology and Racial Difference in Age of Colonialism has class title English (ENGL) 133. English (ENGL) 133 - Transatlantic Literatures and Cultures: Technology and Racial Difference in Age of Colonialism is offered in 1 quarters. In 2022 fall quarter, Lec 2 is offered on Tuesday Thursday at 10am-11:50am.",
            "History (HIST) 12C - Inequality: Global History of Anti-Colonial Thought and Struggle has class ID History (HIST) 12C. History (HIST) 12C - Inequality: Global History of Anti-Colonial Thought and Struggle has class title History (HIST) 12C. History (HIST) 12C - Inequality: Global History of Anti-Colonial Thought and Struggle is offered in 2 quarters. In 2021 spring quarter, Lec 1 is offered on Monday Wednesday at 9:30am-10:45am. In 2022 winter quarter, Lec 1 is offered on Monday Wednesday at 3:30pm-4:45pm.",
            "English (ENGL) 133 - Transatlantic Literatures and Cultures: Lives of Property in Colonial Atlantic World has class ID English (ENGL) 133. English (ENGL) 133 - Transatlantic Literatures and Cultures: Lives of Property in Colonial Atlantic World has class title English (ENGL) 133. English (ENGL) 133 - Transatlantic Literatures and Cultures: Lives of Property in Colonial Atlantic World is offered in 1 quarters. In 2023 fall quarter, Lec 2 is offered on Tuesday Thursday at 4pm-5:50pm."
        ]
    },
    {
        "51": [
            "Mathematics (MATH) 205A - Number Theory has class ID Mathematics (MATH) 205A. Mathematics (MATH) 205A - Number Theory has class title Mathematics (MATH) 205A. Mathematics (MATH) 205A - Number Theory is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday Friday at 10am-10:50am.",
            "Mathematics (MATH) 238A - Dynamical Systems has class ID Mathematics (MATH) 238A. Mathematics (MATH) 238A - Dynamical Systems has class title Mathematics (MATH) 238A. Mathematics (MATH) 238A - Dynamical Systems is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday Friday at 11am-11:50am.",
            "Mathematics (MATH) 213A - Theory of Groups has class ID Mathematics (MATH) 213A. Mathematics (MATH) 213A - Theory of Groups has class title Mathematics (MATH) 213A. Mathematics (MATH) 213A - Theory of Groups is offered in 1 quarters. In 2021 fall quarter, Lec 1 is offered on Monday Wednesday Friday at 9am-9:50am.",
            "Mathematics (MATH) 260 - Introduction to Applied Mathematics has class ID Mathematics (MATH) 260. Mathematics (MATH) 260 - Introduction to Applied Mathematics has class title Mathematics (MATH) 260. Mathematics (MATH) 260 - Introduction to Applied Mathematics is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday Friday at 2pm-2:50pm.",
            "Mathematics (MATH) 216C - Further Topics in Algebra has class ID Mathematics (MATH) 216C. Mathematics (MATH) 216C - Further Topics in Algebra has class title Mathematics (MATH) 216C. Mathematics (MATH) 216C - Further Topics in Algebra is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Monday Wednesday Friday at 11am-11:50am."
        ]
    },
    {
        "52": [
            "Ecology and Evolutionary Biology (EE BIOL) 200A - Evolutionary Biology has class ID Ecology and Evolutionary Biology (EE BIOL) 200A. Ecology and Evolutionary Biology (EE BIOL) 200A - Evolutionary Biology has class title Ecology and Evolutionary Biology (EE BIOL) 200A. Ecology and Evolutionary Biology (EE BIOL) 200A - Evolutionary Biology is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday at W.",
            "Ecology and Evolutionary Biology (EE BIOL) 168 - Global Change Ecology has class ID Ecology and Evolutionary Biology (EE BIOL) 168. Ecology and Evolutionary Biology (EE BIOL) 168 - Global Change Ecology has class title Ecology and Evolutionary Biology (EE BIOL) 168. Ecology and Evolutionary Biology (EE BIOL) 168 - Global Change Ecology is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday Wednesday at 8am-9:15am.",
            "Ecology and Evolutionary Biology (EE BIOL) M232 - Evolutionary Ecology has class ID Ecology and Evolutionary Biology (EE BIOL) M232. Ecology and Evolutionary Biology (EE BIOL) M232 - Evolutionary Ecology has class title Ecology and Evolutionary Biology (EE BIOL) M232. Ecology and Evolutionary Biology (EE BIOL) M232 - Evolutionary Ecology is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:50pm.",
            "Ecology and Evolutionary Biology (EE BIOL) 148 - Biology of Marine Plants has class ID Ecology and Evolutionary Biology (EE BIOL) 148. Ecology and Evolutionary Biology (EE BIOL) 148 - Biology of Marine Plants has class title Ecology and Evolutionary Biology (EE BIOL) 148. Ecology and Evolutionary Biology (EE BIOL) 148 - Biology of Marine Plants is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Wednesday at 8am-8:50am.",
            "Ecology and Evolutionary Biology (EE BIOL) 123B - Field Marine Ecology has class ID Ecology and Evolutionary Biology (EE BIOL) 123B. Ecology and Evolutionary Biology (EE BIOL) 123B - Field Marine Ecology has class title Ecology and Evolutionary Biology (EE BIOL) 123B. Ecology and Evolutionary Biology (EE BIOL) 123B - Field Marine Ecology is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Tuesday at 8am-8:50am."
        ]
    },
    {
        "53": [
            "Electrical and Computer Engineering (EC ENGR) 236C - Optimization Methods for Large-Scale Systems has class ID Electrical and Computer Engineering (EC ENGR) 236C. Electrical and Computer Engineering (EC ENGR) 236C - Optimization Methods for Large-Scale Systems has class title Electrical and Computer Engineering (EC ENGR) 236C. Electrical and Computer Engineering (EC ENGR) 236C - Optimization Methods for Large-Scale Systems is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:50pm.",
            "Electrical and Computer Engineering (EC ENGR) 163A - Introductory Microwave Circuits has class ID Electrical and Computer Engineering (EC ENGR) 163A. Electrical and Computer Engineering (EC ENGR) 163A - Introductory Microwave Circuits has class title Electrical and Computer Engineering (EC ENGR) 163A. Electrical and Computer Engineering (EC ENGR) 163A - Introductory Microwave Circuits is offered in 1 quarters. In 2021 fall quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:50pm.",
            "Electrical and Computer Engineering (EC ENGR) 279AS - Special Topics in Physical and Wave Electronics has class ID Electrical and Computer Engineering (EC ENGR) 279AS. Electrical and Computer Engineering (EC ENGR) 279AS - Special Topics in Physical and Wave Electronics has class title Electrical and Computer Engineering (EC ENGR) 279AS. Electrical and Computer Engineering (EC ENGR) 279AS - Special Topics in Physical and Wave Electronics is offered in 1 quarters. In 2024 spring quarter, Lec 2 is offered on Tuesday Thursday at 10am-11:50am.",
            "Electrical and Computer Engineering (EC ENGR) 239AS - Special Topics in Signals and Systems has class ID Electrical and Computer Engineering (EC ENGR) 239AS. Electrical and Computer Engineering (EC ENGR) 239AS - Special Topics in Signals and Systems has class title Electrical and Computer Engineering (EC ENGR) 239AS. Electrical and Computer Engineering (EC ENGR) 239AS - Special Topics in Signals and Systems is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Monday Wednesday at 10am-11:50am.",
            "Electrical and Computer Engineering (EC ENGR) 149 - Foundations of Computer Vision has class ID Electrical and Computer Engineering (EC ENGR) 149. Electrical and Computer Engineering (EC ENGR) 149 - Foundations of Computer Vision has class title Electrical and Computer Engineering (EC ENGR) 149. Electrical and Computer Engineering (EC ENGR) 149 - Foundations of Computer Vision is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Tuesday Thursday at 12pm-1:50pm."
        ]
    },
    {
        "54": [
            "Management (MGMT) 298D - Special Topics in Management: Quantitative Analysis for Health Systems has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Quantitative Analysis for Health Systems has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Quantitative Analysis for Health Systems is offered in 1 quarters. In 2021 winter quarter, Lec 6 is offered on Monday at 4:10pm-7pm.",
            "Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  is offered in 1 quarters. In 2022 winter quarter, ec 16 is offered on Wednesday at 1pm-3:50pm.",
            "Management (MGMT) 298D - Special Topics in Management: Behavioral Economics: Individuals, Organizations, and Markets  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Behavioral Economics: Individuals, Organizations, and Markets  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Behavioral Economics: Individuals, Organizations, and Markets  is offered in 1 quarters. In 2020 winter quarter, ec 11 is offered on Wednesday at 1pm-3:50pm.",
            "Management (MGMT) 298D - Special Topics in Management: Entrepreneurial Perspectives on Biotechnology  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Entrepreneurial Perspectives on Biotechnology  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Entrepreneurial Perspectives on Biotechnology  is offered in 1 quarters. In 2023 spring quarter, ec 17 is offered on Monday at 4:10pm-7pm.",
            "Management (MGMT) 298D - Special Topics in Management: Global Social Impact Consulting I: East Africa  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Global Social Impact Consulting I: East Africa  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Global Social Impact Consulting I: East Africa  is offered in 1 quarters. In 2023 fall quarter, ec 46 is offered on Wednesday at 8:30am-11:20am."
        ]
    },
    {
        "55": [
            "Nursing 401 - Scientific Underpinnings for DNP Practice  has class ID Nursing 401. Nursing 401 - Scientific Underpinnings for DNP Practice  has class title Nursing 401. Nursing 401 - Scientific Underpinnings for DNP Practice  is offered in 1 quarters. In 2020 fall quarter, ec 80 is offered on Friday at 8am-11am.",
            "Health Policy and Management (HLT POL) M201 - Topics in Theoretical Epidemiology has class ID Health Policy and Management (HLT POL) M201. Health Policy and Management (HLT POL) M201 - Topics in Theoretical Epidemiology has class title Health Policy and Management (HLT POL) M201. Health Policy and Management (HLT POL) M201 - Topics in Theoretical Epidemiology is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Friday at 9am-11:50am.",
            "Nursing 238C - Assessment and Management in Pediatric Healthcare III has class ID Nursing 238C. Nursing 238C - Assessment and Management in Pediatric Healthcare III has class title Nursing 238C. Nursing 238C - Assessment and Management in Pediatric Healthcare III is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Wednesday at W.",
            "Physics and Biology in Medicine (PBMED) 231 - Advanced Treatment Planning in Radiation Therapy has class ID Physics and Biology in Medicine (PBMED) 231. Physics and Biology in Medicine (PBMED) 231 - Advanced Treatment Planning in Radiation Therapy has class title Physics and Biology in Medicine (PBMED) 231. Physics and Biology in Medicine (PBMED) 231 - Advanced Treatment Planning in Radiation Therapy is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Monday Wednesday at 3pm-4:50pm.",
            "History (HIST) 179A - Variable Topics in History of Medicine: Foundations of Modern Medicine has class ID History (HIST) 179A. History (HIST) 179A - Variable Topics in History of Medicine: Foundations of Modern Medicine has class title History (HIST) 179A. History (HIST) 179A - Variable Topics in History of Medicine: Foundations of Modern Medicine is offered in 1 quarters. In 2022 fall quarter, Lec 2 is offered on Monday Wednesday at 12:30pm-1:45pm."
        ]
    },
    {
        "56": [
            "English (ENGL) 200 - Approaches to Literary Research has class ID English (ENGL) 200. English (ENGL) 200 - Approaches to Literary Research has class title English (ENGL) 200. English (ENGL) 200 - Approaches to Literary Research is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Tuesday at 3pm-5:50pm.",
            "English (ENGL) 179 - Topics in Literature, circa 1850 to Present: Illness and Narrative in Literature and Philosophy has class ID English (ENGL) 179. English (ENGL) 179 - Topics in Literature, circa 1850 to Present: Illness and Narrative in Literature and Philosophy has class title English (ENGL) 179. English (ENGL) 179 - Topics in Literature, circa 1850 to Present: Illness and Narrative in Literature and Philosophy is offered in 1 quarters. In 2022 spring quarter, Lec 3 is offered on Tuesday Thursday at 2pm-3:50pm.",
            "English (ENGL) 133 - Transatlantic Literatures and Cultures: Technology and Racial Difference in Age of Colonialism has class ID English (ENGL) 133. English (ENGL) 133 - Transatlantic Literatures and Cultures: Technology and Racial Difference in Age of Colonialism has class title English (ENGL) 133. English (ENGL) 133 - Transatlantic Literatures and Cultures: Technology and Racial Difference in Age of Colonialism is offered in 1 quarters. In 2022 fall quarter, Lec 2 is offered on Tuesday Thursday at 10am-11:50am.",
            "Geography (GEOG) M142 - (When) Do Leaders Make Differences? has class ID Geography (GEOG) M142. Geography (GEOG) M142 - (When) Do Leaders Make Differences? has class title Geography (GEOG) M142. Geography (GEOG) M142 - (When) Do Leaders Make Differences? is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Wednesday at 10am-10:50am.",
            "Anthropology (ANTHRO) 139 - Selected Topics in Cultural Anthropology: What Culture Is, and How People Acquire It has class ID Anthropology (ANTHRO) 139. Anthropology (ANTHRO) 139 - Selected Topics in Cultural Anthropology: What Culture Is, and How People Acquire It has class title Anthropology (ANTHRO) 139. Anthropology (ANTHRO) 139 - Selected Topics in Cultural Anthropology: What Culture Is, and How People Acquire It is offered in 1 quarters. In 2023 fall quarter, Lec 2 is offered on Tuesday at 3:30pm-5:50pm."
        ]
    },
    {
        "57": [
            "Geography (GEOG) M142 - (When) Do Leaders Make Differences? has class ID Geography (GEOG) M142. Geography (GEOG) M142 - (When) Do Leaders Make Differences? has class title Geography (GEOG) M142. Geography (GEOG) M142 - (When) Do Leaders Make Differences? is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Wednesday at 10am-10:50am.",
            "Communication (COMM) 123 - Social Cognition has class ID Communication (COMM) 123. Communication (COMM) 123 - Social Cognition has class title Communication (COMM) 123. Communication (COMM) 123 - Social Cognition is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "Communication (COMM) 130 - Science of Language has class ID Communication (COMM) 130. Communication (COMM) 130 - Science of Language has class title Communication (COMM) 130. Communication (COMM) 130 - Science of Language is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:15pm.",
            "Geography (GEOG) M142 - Past People and Their Lessons for Our Own Future has class ID Geography (GEOG) M142. Geography (GEOG) M142 - Past People and Their Lessons for Our Own Future has class title Geography (GEOG) M142. Geography (GEOG) M142 - Past People and Their Lessons for Our Own Future is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Tuesday at 1pm-2:50pm.",
            "Mathematics (MATH) 100 - Problem Solving has class ID Mathematics (MATH) 100. Mathematics (MATH) 100 - Problem Solving has class title Mathematics (MATH) 100. Mathematics (MATH) 100 - Problem Solving is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Monday Wednesday Friday at 10am-10:50am."
        ]
    },
    {
        "58": [
            "Economics (ECON) 162 - Monetary Policy has class ID Economics (ECON) 162. Economics (ECON) 162 - Monetary Policy has class title Economics (ECON) 162. Economics (ECON) 162 - Monetary Policy is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Monday Wednesday at 5pm-6:15pm.",
            "Economics (ECON) 111 - Theories of Development has class ID Economics (ECON) 111. Economics (ECON) 111 - Theories of Development has class title Economics (ECON) 111. Economics (ECON) 111 - Theories of Development is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "Economics (ECON) 97 - Economic Toolkit has class ID Economics (ECON) 97. Economics (ECON) 97 - Economic Toolkit has class title Economics (ECON) 97. Economics (ECON) 97 - Economic Toolkit is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Tuesday at R.",
            "Economics (ECON) 130 - Public Economics has class ID Economics (ECON) 130. Economics (ECON) 130 - Public Economics has class title Economics (ECON) 130. Economics (ECON) 130 - Public Economics is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Tuesday Thursday at 8am-9:15am.",
            "Economics (ECON) 401A - Microeconomic Theory has class ID Economics (ECON) 401A. Economics (ECON) 401A - Microeconomic Theory has class title Economics (ECON) 401A. Economics (ECON) 401A - Microeconomic Theory is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Tuesday Thursday at T."
        ]
    },
    {
        "59": [
            "Information Studies (INF STD) 410 - Management Theory and Practice for Information Professionals has class ID Information Studies (INF STD) 410. Information Studies (INF STD) 410 - Management Theory and Practice for Information Professionals has class title Information Studies (INF STD) 410. Information Studies (INF STD) 410 - Management Theory and Practice for Information Professionals is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Monday at 1:30pm-5pm.",
            "Management (MGMT) 298D - Special Topics in Management: Judgement and Decision Making has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Judgement and Decision Making has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Judgement and Decision Making is offered in 1 quarters. In 2020 fall quarter, Lec 2 is offered on Monday at 1pm-4pm.",
            "Management (MGMT) 298D - Special Topics in Management: Quantitative Analysis for Health Systems has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Quantitative Analysis for Health Systems has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Quantitative Analysis for Health Systems is offered in 1 quarters. In 2021 winter quarter, Lec 6 is offered on Monday at 4:10pm-7pm.",
            "Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  is offered in 1 quarters. In 2022 winter quarter, ec 16 is offered on Wednesday at 1pm-3:50pm.",
            "Management (MGMT) 298D - Special Topics in Management: Corporate Governance  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance  is offered in 1 quarters. In 2022 winter quarter, ec 15 is offered on Wednesday at 7:10pm-10pm."
        ]
    },
    {
        "60": [
            "Economics (ECON) 111 - Theories of Development has class ID Economics (ECON) 111. Economics (ECON) 111 - Theories of Development has class title Economics (ECON) 111. Economics (ECON) 111 - Theories of Development is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "Economics (ECON) 162 - Monetary Policy has class ID Economics (ECON) 162. Economics (ECON) 162 - Monetary Policy has class title Economics (ECON) 162. Economics (ECON) 162 - Monetary Policy is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Monday Wednesday at 5pm-6:15pm.",
            "Economics (ECON) 401A - Microeconomic Theory has class ID Economics (ECON) 401A. Economics (ECON) 401A - Microeconomic Theory has class title Economics (ECON) 401A. Economics (ECON) 401A - Microeconomic Theory is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Tuesday Thursday at T.",
            "Economics (ECON) 130 - Public Economics has class ID Economics (ECON) 130. Economics (ECON) 130 - Public Economics has class title Economics (ECON) 130. Economics (ECON) 130 - Public Economics is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Tuesday Thursday at 8am-9:15am.",
            "Economics (ECON) 151 - Topics in Labor Economics has class ID Economics (ECON) 151. Economics (ECON) 151 - Topics in Labor Economics has class title Economics (ECON) 151. Economics (ECON) 151 - Topics in Labor Economics is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Monday Wednesday at 11am-12:15pm."
        ]
    },
    {
        "61": [
            "Management (MGMT) 298D - Special Topics in Management has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management is offered in 1 quarters. In 2022 fall quarter, Lec 5 is offered on Wednesday at 4:10pm-7pm.",
            "Management (MGMT) 298D - Special Topics in Management: Judgement and Decision Making has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Judgement and Decision Making has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Judgement and Decision Making is offered in 1 quarters. In 2020 fall quarter, Lec 2 is offered on Monday at 1pm-4pm.",
            "Management (MGMT) 298D - Special Topics in Management: Corporate Governance  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance  is offered in 1 quarters. In 2022 winter quarter, ec 15 is offered on Wednesday at 7:10pm-10pm.",
            "Management (MGMT) 298D - Special Topics in Management: Corporate Governance has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Corporate Governance is offered in 1 quarters. In 2023 spring quarter, Lec 7 is offered on Wednesday at 7:10pm-10pm.",
            "Management (MGMT) 298E - Special Topics in Management: Building Large Language Model Applications has class ID Management (MGMT) 298E. Management (MGMT) 298E - Special Topics in Management: Building Large Language Model Applications has class title Management (MGMT) 298E. Management (MGMT) 298E - Special Topics in Management: Building Large Language Model Applications is offered in 1 quarters. In 2023 fall quarter, Lec 4 is offered on Thursday at 1pm-3:50pm."
        ]
    },
    {
        "62": [
            "History (HIST) M181 - Topics in Jewish History: Middle Eastern Jews in Israel has class ID History (HIST) M181. History (HIST) M181 - Topics in Jewish History: Middle Eastern Jews in Israel has class title History (HIST) M181. History (HIST) M181 - Topics in Jewish History: Middle Eastern Jews in Israel is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Tuesday Thursday at 5pm-6:15pm.",
            "History (HIST) 119D - Topics in Medieval History: Communities of Faith and Profit: Jews, Christians, and Muslims in Medieval Mediterranean, 500 to 1500 has class ID History (HIST) 119D. History (HIST) 119D - Topics in Medieval History: Communities of Faith and Profit: Jews, Christians, and Muslims in Medieval Mediterranean, 500 to 1500 has class title History (HIST) 119D. History (HIST) 119D - Topics in Medieval History: Communities of Faith and Profit: Jews, Christians, and Muslims in Medieval Mediterranean, 500 to 1500 is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Monday Wednesday Friday at 9am-9:50am.",
            "Art History (ART HIS) M110D - Art and Death in Ancient Egypt has class ID Art History (ART HIS) M110D. Art History (ART HIS) M110D - Art and Death in Ancient Egypt has class title Art History (ART HIS) M110D. Art History (ART HIS) M110D - Art and Death in Ancient Egypt is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Tuesday at 10am-12:50pm.",
            "Spanish (SPAN) 150 - Topics in Contemporary Studies: Lost Voices of Andean Indigenous Feminism has class ID Spanish (SPAN) 150. Spanish (SPAN) 150 - Topics in Contemporary Studies: Lost Voices of Andean Indigenous Feminism has class title Spanish (SPAN) 150. Spanish (SPAN) 150 - Topics in Contemporary Studies: Lost Voices of Andean Indigenous Feminism is offered in 1 quarters. In 2020 spring quarter, Lec 4 is offered on Tuesday Thursday at 2pm-3:50pm.",
            "History (HIST) 111C - Topics in Middle Eastern History: Modern: Politics of Minorities and Gender in Middle East has class ID History (HIST) 111C. History (HIST) 111C - Topics in Middle Eastern History: Modern: Politics of Minorities and Gender in Middle East has class title History (HIST) 111C. History (HIST) 111C - Topics in Middle Eastern History: Modern: Politics of Minorities and Gender in Middle East is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Monday Wednesday at 5pm-6:15pm."
        ]
    },
    {
        "63": [
            "Sociology (SOCIOL) 244A - Conversation Analysis I has class ID Sociology (SOCIOL) 244A. Sociology (SOCIOL) 244A - Conversation Analysis I has class title Sociology (SOCIOL) 244A. Sociology (SOCIOL) 244A - Conversation Analysis I is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Tuesday at 4pm-5:50pm.",
            "Sociology (SOCIOL) 180B - Special Topics in Sociology: Sociology of Body has class ID Sociology (SOCIOL) 180B. Sociology (SOCIOL) 180B - Special Topics in Sociology: Sociology of Body has class title Sociology (SOCIOL) 180B. Sociology (SOCIOL) 180B - Special Topics in Sociology: Sociology of Body is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Tuesday at 10am-10:50am.",
            "Sociology (SOCIOL) 208A - Social Network Methods has class ID Sociology (SOCIOL) 208A. Sociology (SOCIOL) 208A - Social Network Methods has class title Sociology (SOCIOL) 208A. Sociology (SOCIOL) 208A - Social Network Methods is offered in 2 quarters. In 2020 spring quarter, Lec 1 is offered on Monday Wednesday at 10:30am-11:50am. In 2022 winter quarter, Lec 1 is offered on Tuesday at R.",
            "Sociology (SOCIOL) 240 - Sociology of Education has class ID Sociology (SOCIOL) 240. Sociology (SOCIOL) 240 - Sociology of Education has class title Sociology (SOCIOL) 240. Sociology (SOCIOL) 240 - Sociology of Education is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Monday at 3pm-5:50pm.",
            "Sociology (SOCIOL) 216A - Survey Research Design has class ID Sociology (SOCIOL) 216A. Sociology (SOCIOL) 216A - Survey Research Design has class title Sociology (SOCIOL) 216A. Sociology (SOCIOL) 216A - Survey Research Design is offered in 1 quarters. In 2023 winter quarter, Lec 1 is offered on Tuesday at 3pm-5:50pm."
        ]
    },
    {
        "64": [
            "Education (EDUC) 202 - Evaluation Theory has class ID Education (EDUC) 202. Education (EDUC) 202 - Evaluation Theory has class title Education (EDUC) 202. Education (EDUC) 202 - Evaluation Theory is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Wednesday at 4pm-6:50pm.",
            "Linguistics (LING) 204C - Speech Perception has class ID Linguistics (LING) 204C. Linguistics (LING) 204C - Speech Perception has class title Linguistics (LING) 204C. Linguistics (LING) 204C - Speech Perception is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Tuesday Thursday at 10am-11:50am.",
            "Education (EDUC) 231C - Advanced Item Response Theory has class ID Education (EDUC) 231C. Education (EDUC) 231C - Advanced Item Response Theory has class title Education (EDUC) 231C. Education (EDUC) 231C - Advanced Item Response Theory is offered in 1 quarters. In 2021 fall quarter, Lec 1 is offered on Monday Wednesday at 10am-11:50am.",
            "Linguistics (LING) 204B - Speech Production has class ID Linguistics (LING) 204B. Linguistics (LING) 204B - Speech Production has class title Linguistics (LING) 204B. Linguistics (LING) 204B - Speech Production is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Tuesday Thursday at 10am-11:50am.",
            "Linguistics (LING) 165C - Semantics II has class ID Linguistics (LING) 165C. Linguistics (LING) 165C - Semantics II has class title Linguistics (LING) 165C. Linguistics (LING) 165C - Semantics II is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday Wednesday at 4pm-5:50pm."
        ]
    },
    {
        "65": [
            "Political Science (POL SCI) 170A - Studies in Statistical Analysis of Political Data: Randomized Trials for Social Change has class ID Political Science (POL SCI) 170A. Political Science (POL SCI) 170A - Studies in Statistical Analysis of Political Data: Randomized Trials for Social Change has class title Political Science (POL SCI) 170A. Political Science (POL SCI) 170A - Studies in Statistical Analysis of Political Data: Randomized Trials for Social Change is offered in 1 quarters. In 2023 winter quarter, Lec 1 is offered on Tuesday Thursday at 11am-12:15pm.",
            "Economics (ECON) 111 - Theories of Development has class ID Economics (ECON) 111. Economics (ECON) 111 - Theories of Development has class title Economics (ECON) 111. Economics (ECON) 111 - Theories of Development is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "Political Science (POL SCI) 170A - Studies in Statistical Analysis of Political Data: Applied Research Methods has class ID Political Science (POL SCI) 170A. Political Science (POL SCI) 170A - Studies in Statistical Analysis of Political Data: Applied Research Methods has class title Political Science (POL SCI) 170A. Political Science (POL SCI) 170A - Studies in Statistical Analysis of Political Data: Applied Research Methods is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday at 9:30am-10:45am.",
            "Philosophy (PHILOS) C253B - Topics in Ethical Theory: Metaethics has class ID Philosophy (PHILOS) C253B. Philosophy (PHILOS) C253B - Topics in Ethical Theory: Metaethics has class title Philosophy (PHILOS) C253B. Philosophy (PHILOS) C253B - Topics in Ethical Theory: Metaethics is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Wednesday at 2pm-4:50pm.",
            "Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  is offered in 1 quarters. In 2022 winter quarter, ec 16 is offered on Wednesday at 1pm-3:50pm."
        ]
    },
    {
        "66": [
            "Anthropology (ANTHRO) CM217 - Selected Laboratory Topics in Archaeology: Provenance Research has class ID Anthropology (ANTHRO) CM217. Anthropology (ANTHRO) CM217 - Selected Laboratory Topics in Archaeology: Provenance Research has class title Anthropology (ANTHRO) CM217. Anthropology (ANTHRO) CM217 - Selected Laboratory Topics in Archaeology: Provenance Research is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Thursday at 10am-1pm.",
            "Anthropology (ANTHRO) C117 - Selected Laboratory Topics in Archaeology: Provenance Research has class ID Anthropology (ANTHRO) C117. Anthropology (ANTHRO) C117 - Selected Laboratory Topics in Archaeology: Provenance Research has class title Anthropology (ANTHRO) C117. Anthropology (ANTHRO) C117 - Selected Laboratory Topics in Archaeology: Provenance Research is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Thursday at 10am-1pm.",
            "Anthropology (ANTHRO) C117 - Selected Laboratory Topics in Archaeology has class ID Anthropology (ANTHRO) C117. Anthropology (ANTHRO) C117 - Selected Laboratory Topics in Archaeology has class title Anthropology (ANTHRO) C117. Anthropology (ANTHRO) C117 - Selected Laboratory Topics in Archaeology is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Wednesday at 1pm-4:50pm, and Lec 2 is offered on Monday at 3pm-5:50pm.",
            "Anthropology (ANTHRO) 119 - Selected Topics in Archaeology: Public Spaces, Past and Present has class ID Anthropology (ANTHRO) 119. Anthropology (ANTHRO) 119 - Selected Topics in Archaeology: Public Spaces, Past and Present has class title Anthropology (ANTHRO) 119. Anthropology (ANTHRO) 119 - Selected Topics in Archaeology: Public Spaces, Past and Present is offered in 1 quarters. In 2021 spring quarter, Lec 1 is offered on Tuesday Thursday at 12:30pm-1:45pm.",
            "Archaeology (ARCHEOL) M205A - Selected Laboratory Topics in Archaeology: Provenance Research has class ID Archaeology (ARCHEOL) M205A. Archaeology (ARCHEOL) M205A - Selected Laboratory Topics in Archaeology: Provenance Research has class title Archaeology (ARCHEOL) M205A. Archaeology (ARCHEOL) M205A - Selected Laboratory Topics in Archaeology: Provenance Research is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Thursday at 10am-1pm."
        ]
    },
    {
        "67": [
            "Engineering (ENGR) 96I - Introduction to Engineering Design: Internet of Things has class ID Engineering (ENGR) 96I. Engineering (ENGR) 96I - Introduction to Engineering Design: Internet of Things has class title Engineering (ENGR) 96I. Engineering (ENGR) 96I - Introduction to Engineering Design: Internet of Things is offered in 2 quarters. In 2022 fall quarter, Lec 1 is offered on Friday at 9am-9:50am. In 2023 fall quarter, Lec 1 is offered on Friday at 9am-9:50am.",
            "Engineering (ENGR) 96A - Introduction to Engineering Design  has class ID Engineering (ENGR) 96A. Engineering (ENGR) 96A - Introduction to Engineering Design  has class title Engineering (ENGR) 96A. Engineering (ENGR) 96A - Introduction to Engineering Design  is offered in 1 quarters. In 2023 fall quarter, ec 14 is offered on Monday at 12pm-1:50pm.",
            "Engineering (ENGR) 96B - Introduction to Engineering Design: Digital Imaging has class ID Engineering (ENGR) 96B. Engineering (ENGR) 96B - Introduction to Engineering Design: Digital Imaging has class title Engineering (ENGR) 96B. Engineering (ENGR) 96B - Introduction to Engineering Design: Digital Imaging is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Friday at 11am-11:50am.",
            "Engineering (ENGR) 96A - Introduction to Engineering Design: Empowering Communities through Infrastructure  has class ID Engineering (ENGR) 96A. Engineering (ENGR) 96A - Introduction to Engineering Design: Empowering Communities through Infrastructure  has class title Engineering (ENGR) 96A. Engineering (ENGR) 96A - Introduction to Engineering Design: Empowering Communities through Infrastructure  is offered in 1 quarters. In 2024 winter quarter, ec 15 is offered on Tuesday at 11am-1:50pm.",
            "Management (MGMT) 298D - Special Topics in Management: Energy, Climate Change, and Finance has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Energy, Climate Change, and Finance has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Energy, Climate Change, and Finance is offered in 1 quarters. In 2022 fall quarter, Lec 6 is offered on Wednesday at 7:10pm-10pm."
        ]
    },
    {
        "68": [
            "Art History (ART HIS) C151 - Selected Topics in Japanese Art: Introduction to Japanese Archaeology has class ID Art History (ART HIS) C151. Art History (ART HIS) C151 - Selected Topics in Japanese Art: Introduction to Japanese Archaeology has class title Art History (ART HIS) C151. Art History (ART HIS) C151 - Selected Topics in Japanese Art: Introduction to Japanese Archaeology is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "Art History (ART HIS) 130 - Selected Topics in Modern Art has class ID Art History (ART HIS) 130. Art History (ART HIS) 130 - Selected Topics in Modern Art has class title Art History (ART HIS) 130. Art History (ART HIS) 130 - Selected Topics in Modern Art is offered in 1 quarters. In 2023 spring quarter, Lec 1 is offered on Monday Wednesday at 12:30pm-1:45pm.",
            "Art History (ART HIS) 251B - Japanese Art: Time and Narrative has class ID Art History (ART HIS) 251B. Art History (ART HIS) 251B - Japanese Art: Time and Narrative has class title Art History (ART HIS) 251B. Art History (ART HIS) 251B - Japanese Art: Time and Narrative is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Thursday at 11am-1:50pm.",
            "History (HIST) 115 - Topics in Ancient History: Race and Ethnicity in Ancient Greece has class ID History (HIST) 115. History (HIST) 115 - Topics in Ancient History: Race and Ethnicity in Ancient Greece has class title History (HIST) 115. History (HIST) 115 - Topics in Ancient History: Race and Ethnicity in Ancient Greece is offered in 1 quarters. In 2023 winter quarter, Lec 1 is offered on Monday Wednesday Friday at 10am-10:50am.",
            "Art History (ART HIS) C149 - Selected Topics in Chinese Art has class ID Art History (ART HIS) C149. Art History (ART HIS) C149 - Selected Topics in Chinese Art has class title Art History (ART HIS) C149. Art History (ART HIS) C149 - Selected Topics in Chinese Art is offered in 1 quarters. In 2023 winter quarter, Lec 1 is offered on Monday at 10am-12:50pm."
        ]
    },
    {
        "69": [
            "Spanish (SPAN) 290 - Special Topics: Representations of Chilean Dictatorship has class ID Spanish (SPAN) 290. Spanish (SPAN) 290 - Special Topics: Representations of Chilean Dictatorship has class title Spanish (SPAN) 290. Spanish (SPAN) 290 - Special Topics: Representations of Chilean Dictatorship is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday at 3pm-5:50pm.",
            "Spanish (SPAN) 223 - Medieval Prose has class ID Spanish (SPAN) 223. Spanish (SPAN) 223 - Medieval Prose has class title Spanish (SPAN) 223. Spanish (SPAN) 223 - Medieval Prose is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Monday at 3pm-5:50pm.",
            "Spanish (SPAN) 130 - Topics in Medieval Studies has class ID Spanish (SPAN) 130. Spanish (SPAN) 130 - Topics in Medieval Studies has class title Spanish (SPAN) 130. Spanish (SPAN) 130 - Topics in Medieval Studies is offered in 1 quarters. In 2021 fall quarter, Lec 1 is offered on Monday Wednesday at 12pm-1:50pm.",
            "Spanish (SPAN) 160 - Topics in Spanish Linguistics: Child Language Acquisition has class ID Spanish (SPAN) 160. Spanish (SPAN) 160 - Topics in Spanish Linguistics: Child Language Acquisition has class title Spanish (SPAN) 160. Spanish (SPAN) 160 - Topics in Spanish Linguistics: Child Language Acquisition is offered in 1 quarters. In 2021 fall quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:50pm.",
            "Spanish (SPAN) 290 - Special Topics: Mexican Novel has class ID Spanish (SPAN) 290. Spanish (SPAN) 290 - Special Topics: Mexican Novel has class title Spanish (SPAN) 290. Spanish (SPAN) 290 - Special Topics: Mexican Novel is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday at 3pm-5:50pm."
        ]
    },
    {
        "70": [
            "Mathematics (MATH) 238A - Dynamical Systems has class ID Mathematics (MATH) 238A. Mathematics (MATH) 238A - Dynamical Systems has class title Mathematics (MATH) 238A. Mathematics (MATH) 238A - Dynamical Systems is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday Friday at 11am-11:50am.",
            "Mathematics (MATH) 275E - Stochastic Particle Systems has class ID Mathematics (MATH) 275E. Mathematics (MATH) 275E - Stochastic Particle Systems has class title Mathematics (MATH) 275E. Mathematics (MATH) 275E - Stochastic Particle Systems is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Monday Wednesday Friday at 9am-9:50am.",
            "Education (EDUC) 230A - Introduction to Research Design and Statistics has class ID Education (EDUC) 230A. Education (EDUC) 230A - Introduction to Research Design and Statistics has class title Education (EDUC) 230A. Education (EDUC) 230A - Introduction to Research Design and Statistics is offered in 2 quarters. In 2021 fall quarter, Lec 1 is offered on Monday at W, and Lec 2 is offered on Monday at W. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday at 10am-11:50am, and Lec 2 is offered on Monday Wednesday at 1pm-2:50pm.",
            "Mathematics (MATH) 254B - Topics in Real Analysis has class ID Mathematics (MATH) 254B. Mathematics (MATH) 254B - Topics in Real Analysis has class title Mathematics (MATH) 254B. Mathematics (MATH) 254B - Topics in Real Analysis is offered in 2 quarters. In 2020 spring quarter, Lec 1 is offered on Monday Wednesday Friday at 12pm-12:50pm. In 2023 winter quarter, Lec 1 is offered on Monday Wednesday Friday at 4pm-4:50pm.",
            "Mathematics (MATH) 254A - Topics in Real Analysis has class ID Mathematics (MATH) 254A. Mathematics (MATH) 254A - Topics in Real Analysis has class title Mathematics (MATH) 254A. Mathematics (MATH) 254A - Topics in Real Analysis is offered in 2 quarters. In 2021 spring quarter, Lec 1 is offered on Monday Wednesday Friday at 9am-9:50am. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday Friday at 2pm-2:50pm."
        ]
    },
    {
        "71": [
            "Statistics (STATS) C116 - Social Statistics has class ID Statistics (STATS) C116. Statistics (STATS) C116 - Social Statistics has class title Statistics (STATS) C116. Statistics (STATS) C116 - Social Statistics is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Monday Wednesday at M.",
            "Statistics (STATS) CM248 - Applied Sampling has class ID Statistics (STATS) CM248. Statistics (STATS) CM248 - Applied Sampling has class title Statistics (STATS) CM248. Statistics (STATS) CM248 - Applied Sampling is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Monday Wednesday at F.",
            "Statistics (STATS) 232C - Cognitive Artificial Intelligence has class ID Statistics (STATS) 232C. Statistics (STATS) 232C - Cognitive Artificial Intelligence has class title Statistics (STATS) 232C. Statistics (STATS) 232C - Cognitive Artificial Intelligence is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Thursday at 4pm-6:50pm.",
            "Statistics (STATS) M222 - Spatial Statistics has class ID Statistics (STATS) M222. Statistics (STATS) M222 - Spatial Statistics has class title Statistics (STATS) M222. Statistics (STATS) M222 - Spatial Statistics is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Tuesday Thursday at 9:30am-10:45am.",
            "Statistics (STATS) 205 - Hierarchical Linear Models has class ID Statistics (STATS) 205. Statistics (STATS) 205 - Hierarchical Linear Models has class title Statistics (STATS) 205. Statistics (STATS) 205 - Hierarchical Linear Models is offered in 2 quarters. In 2021 winter quarter, Lec 1 is offered on Tuesday Thursday at 9:30am-10:45am. In 2024 spring quarter, Lec 1 is offered on Monday Wednesday at M."
        ]
    },
    {
        "72": [
            "Public Affairs (PUB AFF) M131 - Diversity in Aging: Roles of Gender and Ethnicity has class ID Public Affairs (PUB AFF) M131. Public Affairs (PUB AFF) M131 - Diversity in Aging: Roles of Gender and Ethnicity has class title Public Affairs (PUB AFF) M131. Public Affairs (PUB AFF) M131 - Diversity in Aging: Roles of Gender and Ethnicity is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Tuesday Thursday at 4pm-5:50pm.",
            "Applied Linguistics (APPLING) 40W - Language and Gender: Introduction to Gender and Stereotypes has class ID Applied Linguistics (APPLING) 40W. Applied Linguistics (APPLING) 40W - Language and Gender: Introduction to Gender and Stereotypes has class title Applied Linguistics (APPLING) 40W. Applied Linguistics (APPLING) 40W - Language and Gender: Introduction to Gender and Stereotypes is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Tuesday Thursday at 12pm-1:50pm.",
            "Anthropology (ANTHRO) 159 - Selected Topics in Linguistic Anthropology: Language and Climate Change has class ID Anthropology (ANTHRO) 159. Anthropology (ANTHRO) 159 - Selected Topics in Linguistic Anthropology: Language and Climate Change has class title Anthropology (ANTHRO) 159. Anthropology (ANTHRO) 159 - Selected Topics in Linguistic Anthropology: Language and Climate Change is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Tuesday Thursday at 12:30pm-1:45pm.",
            "English (ENGL) M101D - Studies in Queer Literatures and Cultures: Queer American Autobiography has class ID English (ENGL) M101D. English (ENGL) M101D - Studies in Queer Literatures and Cultures: Queer American Autobiography has class title English (ENGL) M101D. English (ENGL) M101D - Studies in Queer Literatures and Cultures: Queer American Autobiography is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday Wednesday at 10am-11:50am.",
            "English (ENGL) 109 - Topics in Race, Ethnicity, Gender, and Sexuality Studies: Queer Indigenous Literature has class ID English (ENGL) 109. English (ENGL) 109 - Topics in Race, Ethnicity, Gender, and Sexuality Studies: Queer Indigenous Literature has class title English (ENGL) 109. English (ENGL) 109 - Topics in Race, Ethnicity, Gender, and Sexuality Studies: Queer Indigenous Literature is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Tuesday Thursday at 4pm-5:50pm."
        ]
    },
    {
        "73": [
            "Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) M101D - Studies in Queer Literatures and Cultures: Queering American Novel has class ID Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) M101D. Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) M101D - Studies in Queer Literatures and Cultures: Queering American Novel has class title Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) M101D. Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) M101D - Studies in Queer Literatures and Cultures: Queering American Novel is offered in 1 quarters. In 2023 spring quarter, Lec 1 is offered on Monday Wednesday at 4pm-5:50pm.",
            "Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) 182 - Variable Topics in Education, Law, and Public Policy: Healing Justice has class ID Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) 182. Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) 182 - Variable Topics in Education, Law, and Public Policy: Healing Justice has class title Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) 182. Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) 182 - Variable Topics in Education, Law, and Public Policy: Healing Justice is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Tuesday Thursday at TR.",
            "Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) 181 - Variable Topics in Queer Diversities: Music, Queerness, and Trauma Studies has class ID Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) 181. Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) 181 - Variable Topics in Queer Diversities: Music, Queerness, and Trauma Studies has class title Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) 181. Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) 181 - Variable Topics in Queer Diversities: Music, Queerness, and Trauma Studies is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:50pm.",
            "Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) 183 - Variable Topics in Queer Subjectivities/Theories/History has class ID Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) 183. Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) 183 - Variable Topics in Queer Subjectivities/Theories/History has class title Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) 183. Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) 183 - Variable Topics in Queer Subjectivities/Theories/History is offered in 1 quarters. In 2021 fall quarter, Lec 1 is offered on Tuesday Thursday at 11am-12:50pm.",
            "Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) M101B - Queer Literatures and Cultures, 1850 to 1970 has class ID Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) M101B. Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) M101B - Queer Literatures and Cultures, 1850 to 1970 has class title Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) M101B. Lesbian, Gay, Bisexual, Transgender, and Queer Studies (LGBTQS) M101B - Queer Literatures and Cultures, 1850 to 1970 is offered in 1 quarters. In 2021 fall quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:50pm."
        ]
    },
    {
        "74": [
            "Asian American Studies (ASIA AM) 174A - Special Courses in Comparative Race, Ethnicity, Gender, and Sexuality: Women of Color Feminisms has class ID Asian American Studies (ASIA AM) 174A. Asian American Studies (ASIA AM) 174A - Special Courses in Comparative Race, Ethnicity, Gender, and Sexuality: Women of Color Feminisms has class title Asian American Studies (ASIA AM) 174A. Asian American Studies (ASIA AM) 174A - Special Courses in Comparative Race, Ethnicity, Gender, and Sexuality: Women of Color Feminisms is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday at 3:30pm-4:45pm.",
            "African American Studies (AF AMER) 241 - Special Topics in Afro-American Studies: Internationalism: Paradigms, Debates, and New Directions has class ID African American Studies (AF AMER) 241. African American Studies (AF AMER) 241 - Special Topics in Afro-American Studies: Internationalism: Paradigms, Debates, and New Directions has class title African American Studies (AF AMER) 241. African American Studies (AF AMER) 241 - Special Topics in Afro-American Studies: Internationalism: Paradigms, Debates, and New Directions is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Tuesday at 4pm-6:50pm.",
            "Asian American Studies (ASIA AM) M128 - Participatory Action Research on Youth Organizing for Racial Justice has class ID Asian American Studies (ASIA AM) M128. Asian American Studies (ASIA AM) M128 - Participatory Action Research on Youth Organizing for Racial Justice has class title Asian American Studies (ASIA AM) M128. Asian American Studies (ASIA AM) M128 - Participatory Action Research on Youth Organizing for Racial Justice is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday Wednesday at 4pm-5:50pm.",
            "English (ENGL) 109 - Topics in Race, Ethnicity, Gender, and Sexuality Studies: Queer Indigenous Literature has class ID English (ENGL) 109. English (ENGL) 109 - Topics in Race, Ethnicity, Gender, and Sexuality Studies: Queer Indigenous Literature has class title English (ENGL) 109. English (ENGL) 109 - Topics in Race, Ethnicity, Gender, and Sexuality Studies: Queer Indigenous Literature is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Tuesday Thursday at 4pm-5:50pm.",
            "English (ENGL) 177 - Interdisciplinary Studies of American Culture: Critical Approaches to Race and Visuality in American Culture has class ID English (ENGL) 177. English (ENGL) 177 - Interdisciplinary Studies of American Culture: Critical Approaches to Race and Visuality in American Culture has class title English (ENGL) 177. English (ENGL) 177 - Interdisciplinary Studies of American Culture: Critical Approaches to Race and Visuality in American Culture is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Monday Wednesday at 6pm-7:50pm."
        ]
    },
    {
        "75": [
            "Education (EDUC) 211B - Educational and Psychological Measurement: Generalizability Theory has class ID Education (EDUC) 211B. Education (EDUC) 211B - Educational and Psychological Measurement: Generalizability Theory has class title Education (EDUC) 211B. Education (EDUC) 211B - Educational and Psychological Measurement: Generalizability Theory is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Wednesday at 2pm-3:50pm.",
            "Communication (COMM) 123 - Social Cognition has class ID Communication (COMM) 123. Communication (COMM) 123 - Social Cognition has class title Communication (COMM) 123. Communication (COMM) 123 - Social Cognition is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "Psychology (PSYCH) 205E - Neural Basis of Reward and Value has class ID Psychology (PSYCH) 205E. Psychology (PSYCH) 205E - Neural Basis of Reward and Value has class title Psychology (PSYCH) 205E. Psychology (PSYCH) 205E - Neural Basis of Reward and Value is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Monday Wednesday at 3:30pm-4:45pm.",
            "Communication (COMM) M123 - Social Cognition has class ID Communication (COMM) M123. Communication (COMM) M123 - Social Cognition has class title Communication (COMM) M123. Communication (COMM) M123 - Social Cognition is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "Sociology (SOCIOL) 205 - Family and Social Change has class ID Sociology (SOCIOL) 205. Sociology (SOCIOL) 205 - Family and Social Change has class title Sociology (SOCIOL) 205. Sociology (SOCIOL) 205 - Family and Social Change is offered in 1 quarters. In 2023 spring quarter, Lec 1 is offered on Monday at 12pm-2:50pm."
        ]
    },
    {
        "76": [
            "History (HIST) 128C - History of Italy, 1848 to Present has class ID History (HIST) 128C. History (HIST) 128C - History of Italy, 1848 to Present has class title History (HIST) 128C. History (HIST) 128C - History of Italy, 1848 to Present is offered in 1 quarters. In 2023 spring quarter, Lec 1 is offered on Monday Wednesday at 11am-12:15pm.",
            "History (HIST) 9C - Introduction to Asian Civilizations: History of Japan has class ID History (HIST) 9C. History (HIST) 9C - Introduction to Asian Civilizations: History of Japan has class title History (HIST) 9C. History (HIST) 9C - Introduction to Asian Civilizations: History of Japan is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "History (HIST) 119D - Topics in Medieval History: Myth of Superhero, Then and Now has class ID History (HIST) 119D. History (HIST) 119D - Topics in Medieval History: Myth of Superhero, Then and Now has class title History (HIST) 119D. History (HIST) 119D - Topics in Medieval History: Myth of Superhero, Then and Now is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Tuesday at R.",
            "History (HIST) 144 - America in World has class ID History (HIST) 144. History (HIST) 144 - America in World has class title History (HIST) 144. History (HIST) 144 - America in World is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Monday Wednesday Friday at 12pm-12:50pm.",
            "History (HIST) 102A - Iran and Persianate World has class ID History (HIST) 102A. History (HIST) 102A - Iran and Persianate World has class title History (HIST) 102A. History (HIST) 102A - Iran and Persianate World is offered in 1 quarters. In 2023 winter quarter, Lec 1 is offered on Tuesday Thursday at 12:30pm-1:45pm."
        ]
    },
    {
        "77": [
            "Ecology and Evolutionary Biology (EE BIOL) 148 - Biology of Marine Plants has class ID Ecology and Evolutionary Biology (EE BIOL) 148. Ecology and Evolutionary Biology (EE BIOL) 148 - Biology of Marine Plants has class title Ecology and Evolutionary Biology (EE BIOL) 148. Ecology and Evolutionary Biology (EE BIOL) 148 - Biology of Marine Plants is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Wednesday at 8am-8:50am.",
            "Ecology and Evolutionary Biology (EE BIOL) 105 - Biology of Invertebrates has class ID Ecology and Evolutionary Biology (EE BIOL) 105. Ecology and Evolutionary Biology (EE BIOL) 105 - Biology of Invertebrates has class title Ecology and Evolutionary Biology (EE BIOL) 105. Ecology and Evolutionary Biology (EE BIOL) 105 - Biology of Invertebrates is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "Ecology and Evolutionary Biology (EE BIOL) 123B - Field Marine Ecology has class ID Ecology and Evolutionary Biology (EE BIOL) 123B. Ecology and Evolutionary Biology (EE BIOL) 123B - Field Marine Ecology has class title Ecology and Evolutionary Biology (EE BIOL) 123B. Ecology and Evolutionary Biology (EE BIOL) 123B - Field Marine Ecology is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Tuesday at 8am-8:50am.",
            "Ecology and Evolutionary Biology (EE BIOL) 123A - Field Marine Ecology has class ID Ecology and Evolutionary Biology (EE BIOL) 123A. Ecology and Evolutionary Biology (EE BIOL) 123A - Field Marine Ecology has class title Ecology and Evolutionary Biology (EE BIOL) 123A. Ecology and Evolutionary Biology (EE BIOL) 123A - Field Marine Ecology is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday at 8am-8:50am.",
            "Ecology and Evolutionary Biology (EE BIOL) 142 - Aquatic Communities has class ID Ecology and Evolutionary Biology (EE BIOL) 142. Ecology and Evolutionary Biology (EE BIOL) 142 - Aquatic Communities has class title Ecology and Evolutionary Biology (EE BIOL) 142. Ecology and Evolutionary Biology (EE BIOL) 142 - Aquatic Communities is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Monday Wednesday at 8:30am-9:45am."
        ]
    },
    {
        "78": [
            "Anthropology (ANTHRO) 139 - Selected Topics in Cultural Anthropology: What Culture Is, and How People Acquire It has class ID Anthropology (ANTHRO) 139. Anthropology (ANTHRO) 139 - Selected Topics in Cultural Anthropology: What Culture Is, and How People Acquire It has class title Anthropology (ANTHRO) 139. Anthropology (ANTHRO) 139 - Selected Topics in Cultural Anthropology: What Culture Is, and How People Acquire It is offered in 1 quarters. In 2023 fall quarter, Lec 2 is offered on Tuesday at 3:30pm-5:50pm.",
            "Anthropology (ANTHRO) 159 - Selected Topics in Linguistic Anthropology: Language and Climate Change has class ID Anthropology (ANTHRO) 159. Anthropology (ANTHRO) 159 - Selected Topics in Linguistic Anthropology: Language and Climate Change has class title Anthropology (ANTHRO) 159. Anthropology (ANTHRO) 159 - Selected Topics in Linguistic Anthropology: Language and Climate Change is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Tuesday Thursday at 12:30pm-1:45pm.",
            "Communication (COMM) M123 - Language and Society: Introduction to Sociolinguistics has class ID Communication (COMM) M123. Communication (COMM) M123 - Language and Society: Introduction to Sociolinguistics has class title Communication (COMM) M123. Communication (COMM) M123 - Language and Society: Introduction to Sociolinguistics is offered in 1 quarters. In 2021 spring quarter, Lec 1 is offered on Tuesday Thursday at 10am-11:50am.",
            "Anthropology (ANTHRO) 149 - Selected Topics in Social Anthropology: Political Imprisonment has class ID Anthropology (ANTHRO) 149. Anthropology (ANTHRO) 149 - Selected Topics in Social Anthropology: Political Imprisonment has class title Anthropology (ANTHRO) 149. Anthropology (ANTHRO) 149 - Selected Topics in Social Anthropology: Political Imprisonment is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday at 3:30pm-4:45pm.",
            "Anthropology (ANTHRO) 149 - Selected Topics in Social Anthropology: Anthropology of Violence has class ID Anthropology (ANTHRO) 149. Anthropology (ANTHRO) 149 - Selected Topics in Social Anthropology: Anthropology of Violence has class title Anthropology (ANTHRO) 149. Anthropology (ANTHRO) 149 - Selected Topics in Social Anthropology: Anthropology of Violence is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Tuesday Thursday at 12:30pm-1:45pm."
        ]
    },
    {
        "79": [
            "Environmental Health Sciences (ENV HLT) 207 - Introduction to Geographic Information Systems has class ID Environmental Health Sciences (ENV HLT) 207. Environmental Health Sciences (ENV HLT) 207 - Introduction to Geographic Information Systems has class title Environmental Health Sciences (ENV HLT) 207. Environmental Health Sciences (ENV HLT) 207 - Introduction to Geographic Information Systems is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Wednesday at R.",
            "Environmental Health Sciences (ENV HLT) 120 - Environment and Health has class ID Environmental Health Sciences (ENV HLT) 120. Environmental Health Sciences (ENV HLT) 120 - Environment and Health has class title Environmental Health Sciences (ENV HLT) 120. Environmental Health Sciences (ENV HLT) 120 - Environment and Health is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:50pm.",
            "Community Health Sciences (COM HLT) 120 - Promoting Healthy Communities has class ID Community Health Sciences (COM HLT) 120. Community Health Sciences (COM HLT) 120 - Promoting Healthy Communities has class title Community Health Sciences (COM HLT) 120. Community Health Sciences (COM HLT) 120 - Promoting Healthy Communities is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Monday Wednesday at 10am-11:50am.",
            "Community Health Sciences (COM HLT) 187B - Introduction to Interventions for At-Risk Populations has class ID Community Health Sciences (COM HLT) 187B. Community Health Sciences (COM HLT) 187B - Introduction to Interventions for At-Risk Populations has class title Community Health Sciences (COM HLT) 187B. Community Health Sciences (COM HLT) 187B - Introduction to Interventions for At-Risk Populations is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Friday at 1pm-3:50pm.",
            "Education (EDUC) 231A - Toolkit for Quantitative Methods Research has class ID Education (EDUC) 231A. Education (EDUC) 231A - Toolkit for Quantitative Methods Research has class title Education (EDUC) 231A. Education (EDUC) 231A - Toolkit for Quantitative Methods Research is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday at 10am-11:50am."
        ]
    },
    {
        "80": [
            "English (ENGL) 200 - Approaches to Literary Research has class ID English (ENGL) 200. English (ENGL) 200 - Approaches to Literary Research has class title English (ENGL) 200. English (ENGL) 200 - Approaches to Literary Research is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Tuesday at 3pm-5:50pm.",
            "English (ENGL) 80 - Major American Authors has class ID English (ENGL) 80. English (ENGL) 80 - Major American Authors has class title English (ENGL) 80. English (ENGL) 80 - Major American Authors is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Tuesday Thursday at 12:30pm-1:45pm.",
            "English (ENGL) 139 - Individual Authors: James Joyce has class ID English (ENGL) 139. English (ENGL) 139 - Individual Authors: James Joyce has class title English (ENGL) 139. English (ENGL) 139 - Individual Authors: James Joyce is offered in 1 quarters. In 2021 fall quarter, Lec 1 is offered on Monday Wednesday at 12pm-1:50pm.",
            "English (ENGL) 114 - Lyric Histories: American Spiritual Poetry has class ID English (ENGL) 114. English (ENGL) 114 - Lyric Histories: American Spiritual Poetry has class title English (ENGL) 114. English (ENGL) 114 - Lyric Histories: American Spiritual Poetry is offered in 1 quarters. In 2023 winter quarter, Lec 1 is offered on Tuesday Thursday at 12pm-1:50pm.",
            "English (ENGL) 139 - Individual Authors: Henry James has class ID English (ENGL) 139. English (ENGL) 139 - Individual Authors: Henry James has class title English (ENGL) 139. English (ENGL) 139 - Individual Authors: Henry James is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Tuesday Thursday at 12pm-1:50pm."
        ]
    },
    {
        "81": [
            "Anthropology (ANTHRO) 130 - Study of Culture has class ID Anthropology (ANTHRO) 130. Anthropology (ANTHRO) 130 - Study of Culture has class title Anthropology (ANTHRO) 130. Anthropology (ANTHRO) 130 - Study of Culture is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday at 12:30pm-1:45pm.",
            "Anthropology (ANTHRO) M148 - (When) Do Leaders Make Differences? has class ID Anthropology (ANTHRO) M148. Anthropology (ANTHRO) M148 - (When) Do Leaders Make Differences? has class title Anthropology (ANTHRO) M148. Anthropology (ANTHRO) M148 - (When) Do Leaders Make Differences? is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Wednesday at 10am-10:50am.",
            "History (HIST) 174B - History of British India I has class ID History (HIST) 174B. History (HIST) 174B - History of British India I has class title History (HIST) 174B. History (HIST) 174B - History of British India I is offered in 1 quarters. In 2021 spring quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "History (HIST) 167A - History of Northeast Africa has class ID History (HIST) 167A. History (HIST) 167A - History of Northeast Africa has class title History (HIST) 167A. History (HIST) 167A - History of Northeast Africa is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Tuesday Thursday at 11am-12:15pm.",
            "History (HIST) 9C - Introduction to Asian Civilizations: History of Japan has class ID History (HIST) 9C. History (HIST) 9C - Introduction to Asian Civilizations: History of Japan has class title History (HIST) 9C. History (HIST) 9C - Introduction to Asian Civilizations: History of Japan is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm."
        ]
    },
    {
        "82": [
            "English (ENGL) 139 - Individual Authors: James Joyce has class ID English (ENGL) 139. English (ENGL) 139 - Individual Authors: James Joyce has class title English (ENGL) 139. English (ENGL) 139 - Individual Authors: James Joyce is offered in 1 quarters. In 2021 fall quarter, Lec 1 is offered on Monday Wednesday at 12pm-1:50pm.",
            "English (ENGL) 139 - Individual Authors: Henry James has class ID English (ENGL) 139. English (ENGL) 139 - Individual Authors: Henry James has class title English (ENGL) 139. English (ENGL) 139 - Individual Authors: Henry James is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Tuesday Thursday at 12pm-1:50pm.",
            "English (ENGL) 200 - Approaches to Literary Research has class ID English (ENGL) 200. English (ENGL) 200 - Approaches to Literary Research has class title English (ENGL) 200. English (ENGL) 200 - Approaches to Literary Research is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Tuesday at 3pm-5:50pm.",
            "English (ENGL) 80 - Major American Authors has class ID English (ENGL) 80. English (ENGL) 80 - Major American Authors has class title English (ENGL) 80. English (ENGL) 80 - Major American Authors is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Tuesday Thursday at 12:30pm-1:45pm.",
            "English (ENGL) 114 - Lyric Histories: American Spiritual Poetry has class ID English (ENGL) 114. English (ENGL) 114 - Lyric Histories: American Spiritual Poetry has class title English (ENGL) 114. English (ENGL) 114 - Lyric Histories: American Spiritual Poetry is offered in 1 quarters. In 2023 winter quarter, Lec 1 is offered on Tuesday Thursday at 12pm-1:50pm."
        ]
    },
    {
        "83": [
            "Spanish (SPAN) 290 - Special Topics: Representations of Chilean Dictatorship has class ID Spanish (SPAN) 290. Spanish (SPAN) 290 - Special Topics: Representations of Chilean Dictatorship has class title Spanish (SPAN) 290. Spanish (SPAN) 290 - Special Topics: Representations of Chilean Dictatorship is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday at 3pm-5:50pm.",
            "Spanish (SPAN) 223 - Medieval Prose has class ID Spanish (SPAN) 223. Spanish (SPAN) 223 - Medieval Prose has class title Spanish (SPAN) 223. Spanish (SPAN) 223 - Medieval Prose is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Monday at 3pm-5:50pm.",
            "Spanish (SPAN) 130 - Topics in Medieval Studies has class ID Spanish (SPAN) 130. Spanish (SPAN) 130 - Topics in Medieval Studies has class title Spanish (SPAN) 130. Spanish (SPAN) 130 - Topics in Medieval Studies is offered in 1 quarters. In 2021 fall quarter, Lec 1 is offered on Monday Wednesday at 12pm-1:50pm.",
            "Spanish (SPAN) 160 - Topics in Spanish Linguistics: Child Language Acquisition has class ID Spanish (SPAN) 160. Spanish (SPAN) 160 - Topics in Spanish Linguistics: Child Language Acquisition has class title Spanish (SPAN) 160. Spanish (SPAN) 160 - Topics in Spanish Linguistics: Child Language Acquisition is offered in 1 quarters. In 2021 fall quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:50pm.",
            "Spanish (SPAN) 290 - Special Topics: Mexican Novel has class ID Spanish (SPAN) 290. Spanish (SPAN) 290 - Special Topics: Mexican Novel has class title Spanish (SPAN) 290. Spanish (SPAN) 290 - Special Topics: Mexican Novel is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday at 3pm-5:50pm."
        ]
    },
    {
        "84": [
            "Art History (ART HIS) C151 - Selected Topics in Japanese Art: Introduction to Japanese Archaeology has class ID Art History (ART HIS) C151. Art History (ART HIS) C151 - Selected Topics in Japanese Art: Introduction to Japanese Archaeology has class title Art History (ART HIS) C151. Art History (ART HIS) C151 - Selected Topics in Japanese Art: Introduction to Japanese Archaeology is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "Art History (ART HIS) C151 - Selected Topics in Japanese Art: Graphic Arts of Japan has class ID Art History (ART HIS) C151. Art History (ART HIS) C151 - Selected Topics in Japanese Art: Graphic Arts of Japan has class title Art History (ART HIS) C151. Art History (ART HIS) C151 - Selected Topics in Japanese Art: Graphic Arts of Japan is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Monday Wednesday at 5pm-6:15pm.",
            "Art History (ART HIS) C251A - Selected Topics in Japanese Art: Graphic Arts of Japan has class ID Art History (ART HIS) C251A. Art History (ART HIS) C251A - Selected Topics in Japanese Art: Graphic Arts of Japan has class title Art History (ART HIS) C251A. Art History (ART HIS) C251A - Selected Topics in Japanese Art: Graphic Arts of Japan is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Monday Wednesday at 5pm-6:15pm.",
            "Art History (ART HIS) C151 - Selected Topics in Japanese Art: Gender and Japanese Art has class ID Art History (ART HIS) C151. Art History (ART HIS) C151 - Selected Topics in Japanese Art: Gender and Japanese Art has class title Art History (ART HIS) C151. Art History (ART HIS) C151 - Selected Topics in Japanese Art: Gender and Japanese Art is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Tuesday Thursday at 3:30pm-4:45pm.",
            "Art History (ART HIS) C149 - Selected Topics in Chinese Art has class ID Art History (ART HIS) C149. Art History (ART HIS) C149 - Selected Topics in Chinese Art has class title Art History (ART HIS) C149. Art History (ART HIS) C149 - Selected Topics in Chinese Art is offered in 1 quarters. In 2023 winter quarter, Lec 1 is offered on Monday at 10am-12:50pm."
        ]
    },
    {
        "85": [
            "Anthropology (ANTHRO) 154Q - Gender and Language in Society has class ID Anthropology (ANTHRO) 154Q. Anthropology (ANTHRO) 154Q - Gender and Language in Society has class title Anthropology (ANTHRO) 154Q. Anthropology (ANTHRO) 154Q - Gender and Language in Society is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Monday Wednesday at 12:30pm-1:45pm.",
            "Anthropology (ANTHRO) 4 - Culture and Communication has class ID Anthropology (ANTHRO) 4. Anthropology (ANTHRO) 4 - Culture and Communication has class title Anthropology (ANTHRO) 4. Anthropology (ANTHRO) 4 - Culture and Communication is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Tuesday Thursday at 11am-12:15pm.",
            "Anthropology (ANTHRO) M148 - (When) Do Leaders Make Differences? has class ID Anthropology (ANTHRO) M148. Anthropology (ANTHRO) M148 - (When) Do Leaders Make Differences? has class title Anthropology (ANTHRO) M148. Anthropology (ANTHRO) M148 - (When) Do Leaders Make Differences? is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Wednesday at 10am-10:50am.",
            "Anthropology (ANTHRO) 130 - Study of Culture has class ID Anthropology (ANTHRO) 130. Anthropology (ANTHRO) 130 - Study of Culture has class title Anthropology (ANTHRO) 130. Anthropology (ANTHRO) 130 - Study of Culture is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday at 12:30pm-1:45pm.",
            "Anthropology (ANTHRO) 135R - Multimedia Ethnography has class ID Anthropology (ANTHRO) 135R. Anthropology (ANTHRO) 135R - Multimedia Ethnography has class title Anthropology (ANTHRO) 135R. Anthropology (ANTHRO) 135R - Multimedia Ethnography is offered in 1 quarters. In 2021 spring quarter, Lec 1 is offered on Thursday at 9am-11:50am."
        ]
    },
    {
        "86": [
            "Chicana/o and Central American Studies (CCAS) 113B - Origin and Evolution of Ritual Traditions in Mexico and Central America has class ID Chicana/o and Central American Studies (CCAS) 113B. Chicana/o and Central American Studies (CCAS) 113B - Origin and Evolution of Ritual Traditions in Mexico and Central America has class title Chicana/o and Central American Studies (CCAS) 113B. Chicana/o and Central American Studies (CCAS) 113B - Origin and Evolution of Ritual Traditions in Mexico and Central America is offered in 1 quarters. In 2021 winter quarter, Lec 1 is offered on Tuesday Thursday at 4pm-5:50pm.",
            "Chicana/o and Central American Studies (CCAS) 169 - Representations of Indigenous Peoples in Americas has class ID Chicana/o and Central American Studies (CCAS) 169. Chicana/o and Central American Studies (CCAS) 169 - Representations of Indigenous Peoples in Americas has class title Chicana/o and Central American Studies (CCAS) 169. Chicana/o and Central American Studies (CCAS) 169 - Representations of Indigenous Peoples in Americas is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Monday Wednesday at 10am-11:50am.",
            "Chicana/o and Central American Studies (CCAS) 143 - Mestizaje: History of Diverse Racial/Cultural Roots of Mexico has class ID Chicana/o and Central American Studies (CCAS) 143. Chicana/o and Central American Studies (CCAS) 143 - Mestizaje: History of Diverse Racial/Cultural Roots of Mexico has class title Chicana/o and Central American Studies (CCAS) 143. Chicana/o and Central American Studies (CCAS) 143 - Mestizaje: History of Diverse Racial/Cultural Roots of Mexico is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday Wednesday at 8am-9:50am.",
            "Chicana/o and Central American Studies (CCAS) M132 - Border Consciousness has class ID Chicana/o and Central American Studies (CCAS) M132. Chicana/o and Central American Studies (CCAS) M132 - Border Consciousness has class title Chicana/o and Central American Studies (CCAS) M132. Chicana/o and Central American Studies (CCAS) M132 - Border Consciousness is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Tuesday Thursday at 12pm-1:50pm.",
            "English (ENGL) 106 - Studies in Native American and Indigenous Literatures: Indigenous Literatures of North America has class ID English (ENGL) 106. English (ENGL) 106 - Studies in Native American and Indigenous Literatures: Indigenous Literatures of North America has class title English (ENGL) 106. English (ENGL) 106 - Studies in Native American and Indigenous Literatures: Indigenous Literatures of North America is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday Wednesday at 4pm-5:50pm."
        ]
    },
    {
        "87": [
            "English (ENGL) 179 - Topics in Literature, circa 1850 to Present: Art of Novel from Austen to Wharton has class ID English (ENGL) 179. English (ENGL) 179 - Topics in Literature, circa 1850 to Present: Art of Novel from Austen to Wharton has class title English (ENGL) 179. English (ENGL) 179 - Topics in Literature, circa 1850 to Present: Art of Novel from Austen to Wharton is offered in 1 quarters. In 2022 spring quarter, Lec 2 is offered on Tuesday Thursday at 2pm-3:50pm.",
            "English (ENGL) 164C - 19th-Century Novel: Novel of Social Realism, from Jane Austen to Thomas Hardy has class ID English (ENGL) 164C. English (ENGL) 164C - 19th-Century Novel: Novel of Social Realism, from Jane Austen to Thomas Hardy has class title English (ENGL) 164C. English (ENGL) 164C - 19th-Century Novel: Novel of Social Realism, from Jane Austen to Thomas Hardy is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Tuesday Thursday at 2pm-3:50pm.",
            "English (ENGL) 179 - Topics in Literature, circa 1850 to Present: Illness and Narrative in Literature and Philosophy has class ID English (ENGL) 179. English (ENGL) 179 - Topics in Literature, circa 1850 to Present: Illness and Narrative in Literature and Philosophy has class title English (ENGL) 179. English (ENGL) 179 - Topics in Literature, circa 1850 to Present: Illness and Narrative in Literature and Philosophy is offered in 1 quarters. In 2022 spring quarter, Lec 3 is offered on Tuesday Thursday at 2pm-3:50pm.",
            "English (ENGL) 179 - Topics in Literature, circa 1850 to Present: Classics of British Children's Literature, 1865 to 1926 has class ID English (ENGL) 179. English (ENGL) 179 - Topics in Literature, circa 1850 to Present: Classics of British Children's Literature, 1865 to 1926 has class title English (ENGL) 179. English (ENGL) 179 - Topics in Literature, circa 1850 to Present: Classics of British Children's Literature, 1865 to 1926 is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday at 10am-11:50am.",
            "English (ENGL) 161A - Poetry in English to 1850: Poetry and Revolution, 1780 to 1830 has class ID English (ENGL) 161A. English (ENGL) 161A - Poetry in English to 1850: Poetry and Revolution, 1780 to 1830 has class title English (ENGL) 161A. English (ENGL) 161A - Poetry in English to 1850: Poetry and Revolution, 1780 to 1830 is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Tuesday Thursday at 12pm-1:50pm."
        ]
    },
    {
        "88": [
            "Statistics (STATS) 420 - Causal Inference in Social Science Practice  has class ID Statistics (STATS) 420. Statistics (STATS) 420 - Causal Inference in Social Science Practice  has class title Statistics (STATS) 420. Statistics (STATS) 420 - Causal Inference in Social Science Practice  is offered in 1 quarters. In 2022 fall quarter, ec 80 is offered on Monday at 6pm-8:50pm.",
            "Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  is offered in 1 quarters. In 2022 winter quarter, ec 16 is offered on Wednesday at 1pm-3:50pm.",
            "Statistics (STATS) M232B - Statistical Computing and Inference in Vision and Cognition has class ID Statistics (STATS) M232B. Statistics (STATS) M232B - Statistical Computing and Inference in Vision and Cognition has class title Statistics (STATS) M232B. Statistics (STATS) M232B - Statistical Computing and Inference in Vision and Cognition is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Monday Wednesday at 3:30pm-4:45pm.",
            "Economics (ECON) 111 - Theories of Development has class ID Economics (ECON) 111. Economics (ECON) 111 - Theories of Development has class title Economics (ECON) 111. Economics (ECON) 111 - Theories of Development is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "Statistics (STATS) 420 - Causal Inference in Social Science Practice has class ID Statistics (STATS) 420. Statistics (STATS) 420 - Causal Inference in Social Science Practice has class title Statistics (STATS) 420. Statistics (STATS) 420 - Causal Inference in Social Science Practice is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Tuesday at 6pm-8:50pm."
        ]
    },
    {
        "89": [
            "Law 214 - Civil Rights: Civil Rights: A Design Approach has class ID Law 214. Law 214 - Civil Rights: Civil Rights: A Design Approach has class title Law 214. Law 214 - Civil Rights: Civil Rights: A Design Approach is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Monday Wednesday at 3:20pm-4:45pm.",
            "Law 456 - The History of American Legal Thought has class ID Law 456. Law 456 - The History of American Legal Thought has class title Law 456. Law 456 - The History of American Legal Thought is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Tuesday Thursday at 1:45pm-3:10pm.",
            "Law 450 - News Media Law in the Digital Age has class ID Law 450. Law 450 - News Media Law in the Digital Age has class title Law 450. Law 450 - News Media Law in the Digital Age is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Wednesday at 3:20pm-5:20pm.",
            "Law 477 - Muslims, Race and the Law has class ID Law 477. Law 477 - Muslims, Race and the Law has class title Law 477. Law 477 - Muslims, Race and the Law is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday Wednesday at 10:35am-12pm.",
            "Law 108A - Lawyering Skills: Legal Research and Writing has class ID Law 108A. Law 108A - Lawyering Skills: Legal Research and Writing has class title Law 108A. Law 108A - Lawyering Skills: Legal Research and Writing is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Wednesday at F."
        ]
    },
    {
        "90": [
            "Indo-European Studies (I E STD) M70 - Language and Evolution has class ID Indo-European Studies (I E STD) M70. Indo-European Studies (I E STD) M70 - Language and Evolution has class title Indo-European Studies (I E STD) M70. Indo-European Studies (I E STD) M70 - Language and Evolution is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Tuesday Thursday at 12:30pm-1:45pm.",
            "Indo-European Studies (I E STD) 240 - Comparative and Historical Grammar of Anatolian has class ID Indo-European Studies (I E STD) 240. Indo-European Studies (I E STD) 240 - Comparative and Historical Grammar of Anatolian has class title Indo-European Studies (I E STD) 240. Indo-European Studies (I E STD) 240 - Comparative and Historical Grammar of Anatolian is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Tuesday Thursday at 11am-12:15pm.",
            "Indo-European Studies (I E STD) M172 - Elementary Luwian has class ID Indo-European Studies (I E STD) M172. Indo-European Studies (I E STD) M172 - Elementary Luwian has class title Indo-European Studies (I E STD) M172. Indo-European Studies (I E STD) M172 - Elementary Luwian is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Tuesday Thursday at 11am-12:15pm.",
            "Anthropology (ANTHRO) 139 - Selected Topics in Cultural Anthropology: What Culture Is, and How People Acquire It has class ID Anthropology (ANTHRO) 139. Anthropology (ANTHRO) 139 - Selected Topics in Cultural Anthropology: What Culture Is, and How People Acquire It has class title Anthropology (ANTHRO) 139. Anthropology (ANTHRO) 139 - Selected Topics in Cultural Anthropology: What Culture Is, and How People Acquire It is offered in 1 quarters. In 2023 fall quarter, Lec 2 is offered on Tuesday at 3:30pm-5:50pm.",
            "Anthropology (ANTHRO) 130 - Study of Culture has class ID Anthropology (ANTHRO) 130. Anthropology (ANTHRO) 130 - Study of Culture has class title Anthropology (ANTHRO) 130. Anthropology (ANTHRO) 130 - Study of Culture is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Monday Wednesday at 12:30pm-1:45pm."
        ]
    },
    {
        "91": [
            "Biomathematics (BIOMATH) M212 - Evolutionary Ecology has class ID Biomathematics (BIOMATH) M212. Biomathematics (BIOMATH) M212 - Evolutionary Ecology has class title Biomathematics (BIOMATH) M212. Biomathematics (BIOMATH) M212 - Evolutionary Ecology is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:50pm.",
            "Biomathematics (BIOMATH) M280 - Statistical Computing has class ID Biomathematics (BIOMATH) M280. Biomathematics (BIOMATH) M280 - Statistical Computing has class title Biomathematics (BIOMATH) M280. Biomathematics (BIOMATH) M280 - Statistical Computing is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Tuesday Thursday at 1pm-2:30pm.",
            "Biomathematics (BIOMATH) 213 - Modeling Vascular Networks has class ID Biomathematics (BIOMATH) 213. Biomathematics (BIOMATH) 213 - Modeling Vascular Networks has class title Biomathematics (BIOMATH) 213. Biomathematics (BIOMATH) 213 - Modeling Vascular Networks is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Monday Wednesday at 3:30pm-5:20pm.",
            "Biomathematics (BIOMATH) M257 - Computational Methods for Biostatistical Research has class ID Biomathematics (BIOMATH) M257. Biomathematics (BIOMATH) M257 - Computational Methods for Biostatistical Research has class title Biomathematics (BIOMATH) M257. Biomathematics (BIOMATH) M257 - Computational Methods for Biostatistical Research is offered in 2 quarters. In 2023 spring quarter, Lec 1 is offered on Tuesday at R. In 2024 spring quarter, Lec 1 is offered on Tuesday at R.",
            "Biomathematics (BIOMATH) M226 - Machine Learning in Bioinformatics has class ID Biomathematics (BIOMATH) M226. Biomathematics (BIOMATH) M226 - Machine Learning in Bioinformatics has class title Biomathematics (BIOMATH) M226. Biomathematics (BIOMATH) M226 - Machine Learning in Bioinformatics is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:50pm."
        ]
    },
    {
        "92": [
            "Economics (ECON) 162 - Monetary Policy has class ID Economics (ECON) 162. Economics (ECON) 162 - Monetary Policy has class title Economics (ECON) 162. Economics (ECON) 162 - Monetary Policy is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Monday Wednesday at 5pm-6:15pm.",
            "Economics (ECON) 97 - Economic Toolkit has class ID Economics (ECON) 97. Economics (ECON) 97 - Economic Toolkit has class title Economics (ECON) 97. Economics (ECON) 97 - Economic Toolkit is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Tuesday at R.",
            "Economics (ECON) 111 - Theories of Development has class ID Economics (ECON) 111. Economics (ECON) 111 - Theories of Development has class title Economics (ECON) 111. Economics (ECON) 111 - Theories of Development is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm.",
            "Economics (ECON) 401A - Microeconomic Theory has class ID Economics (ECON) 401A. Economics (ECON) 401A - Microeconomic Theory has class title Economics (ECON) 401A. Economics (ECON) 401A - Microeconomic Theory is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Tuesday Thursday at T.",
            "Economics (ECON) 130 - Public Economics has class ID Economics (ECON) 130. Economics (ECON) 130 - Public Economics has class title Economics (ECON) 130. Economics (ECON) 130 - Public Economics is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Tuesday Thursday at 8am-9:15am."
        ]
    },
    {
        "93": [
            "Political Science (POL SCI) 126 - Peace and War has class ID Political Science (POL SCI) 126. Political Science (POL SCI) 126 - Peace and War has class title Political Science (POL SCI) 126. Political Science (POL SCI) 126 - Peace and War is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Tuesday Thursday at 11am-12:15pm.",
            "Political Science (POL SCI) 116B - Continental Political Thought has class ID Political Science (POL SCI) 116B. Political Science (POL SCI) 116B - Continental Political Thought has class title Political Science (POL SCI) 116B. Political Science (POL SCI) 116B - Continental Political Thought is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Tuesday Thursday at 3:30pm-4:45pm.",
            "Political Science (POL SCI) 143C - Politics of American Suburbanization has class ID Political Science (POL SCI) 143C. Political Science (POL SCI) 143C - Politics of American Suburbanization has class title Political Science (POL SCI) 143C. Political Science (POL SCI) 143C - Politics of American Suburbanization is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Monday Wednesday at 3:30pm-4:45pm.",
            "Political Science (POL SCI) 119 - Special Studies in Political Theory: Environmental Political Theory has class ID Political Science (POL SCI) 119. Political Science (POL SCI) 119 - Special Studies in Political Theory: Environmental Political Theory has class title Political Science (POL SCI) 119. Political Science (POL SCI) 119 - Special Studies in Political Theory: Environmental Political Theory is offered in 1 quarters. In 2020 spring quarter, Lec 2 is offered on Monday Wednesday at 5pm-6:15pm.",
            "Political Science (POL SCI) 10 - Introduction to Political Theory has class ID Political Science (POL SCI) 10. Political Science (POL SCI) 10 - Introduction to Political Theory has class title Political Science (POL SCI) 10. Political Science (POL SCI) 10 - Introduction to Political Theory is offered in 2 quarters. In 2020 spring quarter, Lec 1 is offered on Monday Wednesday at 12:30pm-1:45pm. In 2024 spring quarter, Lec 1 is offered on Tuesday Thursday at 12:30pm-1:45pm."
        ]
    },
    {
        "94": [
            "Education (EDUC) 160 - Transformative Research in Community-Based Settings has class ID Education (EDUC) 160. Education (EDUC) 160 - Transformative Research in Community-Based Settings has class title Education (EDUC) 160. Education (EDUC) 160 - Transformative Research in Community-Based Settings is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Tuesday Thursday at 12pm-1:50pm.",
            "Education (EDUC) 188B - Transformative Research in Community-Based Settings has class ID Education (EDUC) 188B. Education (EDUC) 188B - Transformative Research in Community-Based Settings has class title Education (EDUC) 188B. Education (EDUC) 188B - Transformative Research in Community-Based Settings is offered in 1 quarters. In 2020 spring quarter, Lec 1 is offered on Wednesday at 12pm-3:50pm.",
            "Education (EDUC) 188A - Transformative Research in Community-Based Settings has class ID Education (EDUC) 188A. Education (EDUC) 188A - Transformative Research in Community-Based Settings has class title Education (EDUC) 188A. Education (EDUC) 188A - Transformative Research in Community-Based Settings is offered in 1 quarters. In 2020 winter quarter, Lec 1 is offered on Wednesday at 12pm-3:50pm.",
            "Education (EDUC) 150 - Introduction to Quantitative Research in Education: Claims and Evidence has class ID Education (EDUC) 150. Education (EDUC) 150 - Introduction to Quantitative Research in Education: Claims and Evidence has class title Education (EDUC) 150. Education (EDUC) 150 - Introduction to Quantitative Research in Education: Claims and Evidence is offered in 2 quarters. In 2020 fall quarter, Lec 1 is offered on Monday Wednesday at 10am-11:50am. In 2020 spring quarter, Lec 1 is offered on Tuesday at 12pm-1:50pm.",
            "Education (EDUC) 222D - Qualitative Inquiry: Special Topics: Research Interview Methods has class ID Education (EDUC) 222D. Education (EDUC) 222D - Qualitative Inquiry: Special Topics: Research Interview Methods has class title Education (EDUC) 222D. Education (EDUC) 222D - Qualitative Inquiry: Special Topics: Research Interview Methods is offered in 1 quarters. In 2020 spring quarter, Lec 2 is offered on Monday at 8am-11:50am."
        ]
    },
    {
        "95": [
            "African American Studies (AF AMER) M5 - Social Organization of Black Communities has class ID African American Studies (AF AMER) M5. African American Studies (AF AMER) M5 - Social Organization of Black Communities has class title African American Studies (AF AMER) M5. African American Studies (AF AMER) M5 - Social Organization of Black Communities is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Monday Wednesday at 12pm-1:50pm.",
            "African American Studies (AF AMER) M159P - Constructing Race has class ID African American Studies (AF AMER) M159P. African American Studies (AF AMER) M159P - Constructing Race has class title African American Studies (AF AMER) M159P. African American Studies (AF AMER) M159P - Constructing Race is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Monday Wednesday at 12:30pm-1:45pm.",
            "African American Studies (AF AMER) 108 - Jazz and Political Imagination has class ID African American Studies (AF AMER) 108. African American Studies (AF AMER) 108 - Jazz and Political Imagination has class title African American Studies (AF AMER) 108. African American Studies (AF AMER) 108 - Jazz and Political Imagination is offered in 2 quarters. In 2021 winter quarter, Lec 1 is offered on Tuesday Thursday at 11am-12:15pm. In 2024 spring quarter, Lec 1 is offered on Monday Wednesday at 11am-12:15pm.",
            "African American Studies (AF AMER) 6 - Trends in Black Intellectual Thought has class ID African American Studies (AF AMER) 6. African American Studies (AF AMER) 6 - Trends in Black Intellectual Thought has class title African American Studies (AF AMER) 6. African American Studies (AF AMER) 6 - Trends in Black Intellectual Thought is offered in 3 quarters. In 2020 winter quarter, Lec 1 is offered on Monday Wednesday at 2pm-3:15pm. In 2021 winter quarter, Lec 1 is offered on Thursday at 4pm-5:50pm. In 2023 winter quarter, Lec 1 is offered on Monday Wednesday at 5pm-6:15pm.",
            "African American Studies (AF AMER) 188A - Special Courses in African American Studies: Black Deejay Culture and Music Migration has class ID African American Studies (AF AMER) 188A. African American Studies (AF AMER) 188A - Special Courses in African American Studies: Black Deejay Culture and Music Migration has class title African American Studies (AF AMER) 188A. African American Studies (AF AMER) 188A - Special Courses in African American Studies: Black Deejay Culture and Music Migration is offered in 1 quarters. In 2020 fall quarter, Lec 2 is offered on Monday at 10am-12:50pm."
        ]
    },
    {
        "96": [
            "Psychology (PSYCH) 119P - Emerging Topics in Neuroscience has class ID Psychology (PSYCH) 119P. Psychology (PSYCH) 119P - Emerging Topics in Neuroscience has class title Psychology (PSYCH) 119P. Psychology (PSYCH) 119P - Emerging Topics in Neuroscience is offered in 1 quarters. In 2022 fall quarter, Lec 1 is offered on Tuesday at R.",
            "Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Making Difficult Decisions: Behavioral Ethics in Leadership  is offered in 1 quarters. In 2022 winter quarter, ec 16 is offered on Wednesday at 1pm-3:50pm.",
            "Psychology (PSYCH) 220B - Research Methods in Social Psychology has class ID Psychology (PSYCH) 220B. Psychology (PSYCH) 220B - Research Methods in Social Psychology has class title Psychology (PSYCH) 220B. Psychology (PSYCH) 220B - Research Methods in Social Psychology is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Tuesday at 9:30am-12:20pm.",
            "Management (MGMT) 298D - Special Topics in Management: Applied Analysis for Behavioral Research has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Applied Analysis for Behavioral Research has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Applied Analysis for Behavioral Research is offered in 1 quarters. In 2020 fall quarter, Lec 1 is offered on Tuesday at 1pm-4pm.",
            "Management (MGMT) 298D - Special Topics in Management: Foundations of Strategy Research  has class ID Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Foundations of Strategy Research  has class title Management (MGMT) 298D. Management (MGMT) 298D - Special Topics in Management: Foundations of Strategy Research  is offered in 1 quarters. In 2022 winter quarter, ec 23 is offered on Wednesday at 1pm-4pm."
        ]
    },
    {
        "97": [
            "Theater C153E - History of Costume Design in Movies has class ID Theater C153E. Theater C153E - History of Costume Design in Movies has class title Theater C153E. Theater C153E - History of Costume Design in Movies is offered in 2 quarters. In 2021 spring quarter, Lec 1 is offered on Tuesday at T. In 2024 spring quarter, Lec 1 is offered on Tuesday at 9am-12:50pm.",
            "Theater 441B - Lighting Design has class ID Theater 441B. Theater 441B - Lighting Design has class title Theater 441B. Theater 441B - Lighting Design is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Monday at 9am-12:50pm.",
            "Theater 442A - Costume Design has class ID Theater 442A. Theater 442A - Costume Design has class title Theater 442A. Theater 442A - Costume Design is offered in 1 quarters. In 2021 fall quarter, Lec 1 is offered on Friday at 9am-12:50pm.",
            "Theater C452C - Lighting Design for Television has class ID Theater C452C. Theater C452C - Lighting Design for Television has class title Theater C452C. Theater C452C - Lighting Design for Television is offered in 1 quarters. In 2023 spring quarter, Lec 1 is offered on Friday at 9am-12:50pm.",
            "Theater C453E - History of Costume Design in Movies has class ID Theater C453E. Theater C453E - History of Costume Design in Movies has class title Theater C453E. Theater C453E - History of Costume Design in Movies is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Tuesday at 9am-12:50pm."
        ]
    },
    {
        "98": [
            "Chicana/o and Central American Studies (CCAS) 153B - Central American Racial Constructions has class ID Chicana/o and Central American Studies (CCAS) 153B. Chicana/o and Central American Studies (CCAS) 153B - Central American Racial Constructions has class title Chicana/o and Central American Studies (CCAS) 153B. Chicana/o and Central American Studies (CCAS) 153B - Central American Racial Constructions is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Tuesday at R.",
            "Chicana/o and Central American Studies (CCAS) 146 - Chicano Narrative has class ID Chicana/o and Central American Studies (CCAS) 146. Chicana/o and Central American Studies (CCAS) 146 - Chicano Narrative has class title Chicana/o and Central American Studies (CCAS) 146. Chicana/o and Central American Studies (CCAS) 146 - Chicano Narrative is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Tuesday Thursday at 11am-12:15pm.",
            "Chicana/o and Central American Studies (CCAS) 153D - U.S. Central American Narratives has class ID Chicana/o and Central American Studies (CCAS) 153D. Chicana/o and Central American Studies (CCAS) 153D - U.S. Central American Narratives has class title Chicana/o and Central American Studies (CCAS) 153D. Chicana/o and Central American Studies (CCAS) 153D - U.S. Central American Narratives is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Tuesday Thursday at R.",
            "Chicana/o and Central American Studies (CCAS) 169 - Representations of Indigenous Peoples in Americas has class ID Chicana/o and Central American Studies (CCAS) 169. Chicana/o and Central American Studies (CCAS) 169 - Representations of Indigenous Peoples in Americas has class title Chicana/o and Central American Studies (CCAS) 169. Chicana/o and Central American Studies (CCAS) 169 - Representations of Indigenous Peoples in Americas is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Monday Wednesday at 10am-11:50am.",
            "Chicana/o and Central American Studies (CCAS) M132 - Border Consciousness has class ID Chicana/o and Central American Studies (CCAS) M132. Chicana/o and Central American Studies (CCAS) M132 - Border Consciousness has class title Chicana/o and Central American Studies (CCAS) M132. Chicana/o and Central American Studies (CCAS) M132 - Border Consciousness is offered in 1 quarters. In 2022 spring quarter, Lec 1 is offered on Tuesday Thursday at 12pm-1:50pm."
        ]
    },
    {
        "99": [
            "History (HIST) M150C - Introduction to Afro-American History has class ID History (HIST) M150C. History (HIST) M150C - Introduction to Afro-American History has class title History (HIST) M150C. History (HIST) M150C - Introduction to Afro-American History is offered in 1 quarters. In 2024 winter quarter, Lec 1 is offered on Tuesday Thursday at 11am-12:15pm.",
            "History (HIST) 164E - Topics in African History: Africa, 1945 to Present: African Postcolony has class ID History (HIST) 164E. History (HIST) 164E - Topics in African History: Africa, 1945 to Present: African Postcolony has class title History (HIST) 164E. History (HIST) 164E - Topics in African History: Africa, 1945 to Present: African Postcolony is offered in 1 quarters. In 2022 winter quarter, Lec 1 is offered on Monday Wednesday Friday at 2pm-2:50pm.",
            "History (HIST) 164E - Topics in African History: Africa, 1945 to Present has class ID History (HIST) 164E. History (HIST) 164E - Topics in African History: Africa, 1945 to Present has class title History (HIST) 164E. History (HIST) 164E - Topics in African History: Africa, 1945 to Present is offered in 1 quarters. In 2021 spring quarter, Lec 1 is offered on Monday Wednesday Friday at 3pm-3:50pm.",
            "History (HIST) 167A - History of Northeast Africa has class ID History (HIST) 167A. History (HIST) 167A - History of Northeast Africa has class title History (HIST) 167A. History (HIST) 167A - History of Northeast Africa is offered in 1 quarters. In 2023 fall quarter, Lec 1 is offered on Tuesday Thursday at 11am-12:15pm.",
            "History (HIST) 165 - Topics in African History has class ID History (HIST) 165. History (HIST) 165 - Topics in African History has class title History (HIST) 165. History (HIST) 165 - Topics in African History is offered in 1 quarters. In 2024 spring quarter, Lec 1 is offered on Monday Wednesday at 9:30am-10:45am."
        ]
    }
]